{
  "spells": [
    {
      "id": "acid_arrow",
      "name": "Acid Arrow",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "description": "<p>You launch a missile of acid toward your target. Make a ranged spell attack against the target. On a hit, the target takes 4d4 acid damage immediately and 2d4 acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage and no damage at the end of its next turn.</p> <p><em>At Higher Tiers</em>. The damage (both initial and later) increases by 1d4 for each additional tier.</p>"
    },
    {
      "id": "acid_splash",
      "name": "Acid Splash",
      "tier": "Cantrip",
      "source": "Arcane",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "description": "<p>You conjure a glob of acid to burst over your targets. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a DEX save or take 1d6 acid damage.</p><p>This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>"
    },
    {
      "id": "aid",
      "name": "Aid",
      "tier": "2nd",
      "source": "Divine",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>You bless allies with heightened vitality and newfound determination. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration.</p><p><em>At Higher Tiers</em>. A target's hit points increase by another 5 points for each additional tier.</p>"
    },
    {
      "id": "alter_self",
      "name": "Alter Self",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You assume a different form. When you cast the spell, choose one of the following options. While the spell lasts, you can end one option as an action to gain the benefits of a different one. <p><strong>Aquatic Adaptation</strong>. You adapt your body to an aquatic environment, sprouting gills and growing webbing between your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed. <p><strong>Change Appearance</strong>. You transform your appearance, including your height, weight, facial features, voice, hair length, coloration, and distinguishing characteristics. You can make yourself appear as a member of another race, though none of your statistics change. You can't appear as a creature of a different size or basic shape than you; if you're bipedal, you can't use this spell to become quadrupedal, for instance. At any time for the duration, you can use your action to change your appearance again. <p><strong>Natural Weapons</strong>. You grow a natural weapon of your choice such as claws, fangs, spines, or horns. Your unarmed strikes deal 1d6 bludgeoning, piercing, or slashing damage, as appropriate, and you are proficient with your unarmed strikes. The natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it.</p>"
    },
    {
      "id": "animal_friendship",
      "name": "Animal Friendship",
      "tier": "1st",
      "source": "Primordial",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "24 hours",
      "description": "<p>You convince a beast you mean no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spell ends.</p><p><em>At Higher Tiers</em>. You can affect one additional beast for each tier above 1st.</p>"
    },
    {
      "id": "animal_shapes",
      "name": "Animal Shapes",
      "tier": "8th",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 24 hours",
      "description": "<p>Your magic turns others into animals. Choose any number of willing creatures that you can see within range. You transform each target into the form of a Large or smaller Beast or creature with the Animal tag with a CR 4 or lower. On subsequent turns, you can use your action to transform affected creatures into new forms.</p><p>The transformation lasts for the duration for each target or until the target drops to 0 HP or dies. You can choose a different form for each target. A target's game statistics are replaced by the statistics of the chosen form, though the target retains its personality and Intelligence, Wisdom, and Charisma scores. The target assumes the hit points of its new form, and when it reverts to its normal form, it returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 HP, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 HP, it isn't knocked unconscious. The creature is limited in the actions it can perform by the nature of its new form, and it can't speak or cast spells.</p><p>The target's gear melds into the new form. The target can't activate, wield, or otherwise benefit from any of its equipment.</p>"
    },
    {
      "id": "antilife_shell",
      "name": "Antilife Shell",
      "tier": "5th",
      "source": "Divine and Primordial",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self (10-foot radius)",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>A ward around you prevents living things from breaching its border. A shimmering barrier extends out from you in a 10-foot radius and moves with you. It remains centered on you, hedging out creatures other than Undead and Constructs. The barrier lasts for the duration.</p><p>The barrier prevents an affected creature from passing or reaching through. An affected creature can cast spells or make attacks with ranged or reach weapons through the barrier.</p><p>If you move so that an affected creature is forced to pass through the barrier, the spell ends.</p>"
    },
    {
      "id": "arcane_eye",
      "name": "Arcane Eye",
      "tier": "4th",
      "source": "Arcane",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You create a spectral eye within range that hovers in the air for the duration. You mentally receive visual information from the eye, which has normal vision and darkvision to a range of 30 feet. The eye can look in every direction. It has a passive stealth equal to 10 + your spell ability modifier.</p><p>As an action, you can move the eye up to 30 feet in any direction. There is no limit to how far away from you the eye can move, but it can't enter another plane of existence. A solid barrier blocks the eye's movement, but the eye can pass through an opening as small as 1 inch in diameter.</p>"
    },
    {
      "id": "arcane_hand",
      "name": "Arcane Hand",
      "tier": "5th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You create a Large hand of shimmering, translucent force in an unoccupied space that you can see within range. The hand lasts for the spell's duration, and it moves at your command, mimicking the movements of your own hand.</p><p>The hand is an object that has AC 20 and hit points equal to your hit point maximum. If it drops to 0 HP, the spell ends. It has a Strength of +8 and a Dexterity of +0. Creatures can occupy the same space as the hand.</p><p>When you cast the spell and as a bonus action on your subsequent turns, you can move the hand up to 60 feet and then cause one of the following effects with it.</p><p><em>Clenched Fist.</em> The hand strikes one creature or object within 5 feet of it. Make a melee spell attack for the hand using your own spell attack modifier. On a hit, the target takes 4d8 force damage.</p><p><em>Forceful Hand.</em> The hand attempts to push a creature within 5 feet of it in a direction you choose. Make a check with the hand's Strength contested by the Strength (Athletics) check of the target. If the target is Medium or smaller, you have advantage on the check. If you succeed, the hand pushes the target up to 5 feet plus a number of feet equal to five times your spellcasting ability modifier. The hand moves with the target to remain within 5 feet of it.</p><p><em>Grasping Hand.</em> The hand attempts to grapple a Huge or smaller creature within 5 feet of it. You use the hand's Strength to resolve the grapple. If the target is Medium or smaller, you have advantage on the check. While the hand is grappling the target, you can use a bonus action to have the hand crush it. When you do so, the target takes bludgeoning damage equal to 2d6 + your spellcasting ability modifier.</p><p><em>Interposing Hand.</em> The hand interposes itself between you and a creature you choose until you give the hand a different command. The hand moves to stay between you and the target, providing you with half cover against the target. The target can't move through the hand's space if its Strength is less than or equal to the hand's Strength. If its Strength is higher than the hand's Strength, the target can move toward you through the hand's space, but that space is difficult terrain for the target.</p><p><em>At Higher Tiers.</em> For each additional tier, add 2d8 damage to the Clenched Fist or 2d6 damage to the Grasping Hand.</p>"
    },
    {
      "id": "arcane_sword",
      "name": "Arcane Sword",
      "tier": "7th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S, M (a miniature platinum sword worth 250 gp)",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>When the sword appears, you make two melee spell attacks with the blade, each one against a target of your choice within 5 feet of the sword. On a hit, the target takes 3d10 + your spellcasting modifier force damage. Until the spell ends, you can use a bonus action on each of your turns to move the sword up to 30 feet to an unoccupied spot you can see and repeat these attacks against targets within 5 feet of the blade.</p>"
    },
    {
      "id": "awaken",
      "name": "Awaken",
      "tier": "5th",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "8 hours (ritual)",
      "range": "Touch",
      "components": "V, S, M (1000 gp gem which the spell consumes)",
      "duration": null,
      "description": "<p>After completing the ritual, you touch a Huge or smaller Beast or Plant. The target gains an INT of +0 and can speak one language you know. If it's a Plant, it gains mobility and senses like a human's, with appropriate statistics chosen by your GM.</p><p>The awakened creature is charmed by you for 30 days or until harmed. After the charm ends, it decides whether to stay friendly based on your treatment during the charm.</p>"
    },
    {
      "id": "barrage",
      "name": "Barrage",
      "tier": "1st",
      "source": "Arcane, Primordial, and Wyrd",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "S",
      "duration": null,
      "description": "<p>Choose a group of tiny objects from a visible 5-foot cube within range that are not worn or carried. You levitate and launch them in a straight line up to 90 feet. If the objects would hit a creature, it must make a DEX save. On a failed save, the target takes 3d8 bludgeoning damage. On a success, the objects continue until they hit something or reach their range.</p><p><em>At Higher Tiers</em>. Add +1d8 damage for each additional tier.</p>"
    },
    {
      "id": "bane",
      "name": "Bane",
      "tier": "1st",
      "source": "Divine and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You curse several targets within range with bad luck and ill will in their impending struggles. Up to three creatures of your choice that you can see within range must make CHA saves. Whenever a target that fails this save makes an attack roll or a save before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or save.</p><p><em>At Higher Tiers.</em> You can target one additional creature for each additional tier.</p>"
    },
    {
      "id": "banishment",
      "name": "Banishment",
      "tier": "4th",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a CHA save or be banished. It can repeat the save at the end of each of its turns.</p><p>If the target is native to the plane of existence you're on, you banish the target to a harmless demiplane. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied.</p><p>If the target is native to a different plane of existence than the one you're on, the target is banished to its home plane. If the spell ends before 1 minute has passed, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn't return.</p><p><em>At Higher Tiers.</em> Target one more creature for each additional tier.</p>"
    },
    {
      "id": "barkskin",
      "name": "Barkskin",
      "tier": "2nd",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You cause a target's skin to grow craggy and resilient, like tree bark. You touch a willing creature. Until the spell ends, the creature's skin has a rough, bark-like appearance, and its AC can't be less than 16, regardless of the armor it wears.</p>"
    },
    {
      "id": "beacon_of_hope",
      "name": "Beacon of Hope",
      "tier": "3rd",
      "source": "Divine",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self (30-foot radius)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>A wave of positivity issues from you, bestowing hope and vitality to nearby allies. Choose any number of creatures within range. For the duration, each target has advantage on WIS saves and death saves, and regains the maximum number of hit points possible from any healing.</p>"
    },
    {
      "id": "bestow_curse",
      "name": "Bestow Curse",
      "tier": "3rd",
      "source": "Divine",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>With a simple touch, you inflict a creature with a weakness of your choosing. You touch a creature, and that creature must succeed on a WIS save or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:</p><ul><li>Choose one ability score. While cursed, the target has disadvantage on ability checks and saves made with that ability score.</li><li>While cursed, the target has disadvantage on attack rolls against you.</li><li>While cursed, the target must make a WIS save at the start of each of its turns. If it fails, it wastes its action that turn doing nothing.</li><li>While the target is cursed, your attacks and spells deal an extra 1d8 necrotic damage to the target.</li></ul><p>A remove curse spell ends this effect. At the GM's option, you may choose an alternative curse effect, but it should be no more powerful than those described above. The GM has final say on such a curse's effect.</p><p><em>At Higher Tiers.</em> The spell's duration increases at 4th tier (10 minutes), 5th tier (8 hours), 7th tier (24 hours), and 9th tier (until dispelled). The spell does not require concentration at 5th tier or higher.</p>"
    },
    {
      "id": "black_tentacles",
      "name": "Black Tentacles",
      "tier": "4th",
      "source": "Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Squirming, ebony tentacles fill a 20-foot square on ground that you can see within range. For the duration, these tentacles turn the ground in the area into difficult terrain. When a creature enters the affected area for the first time on a turn or starts its turn there, the creature must succeed on a DEX save or take 3d6 bludgeoning damage and be restrained by the tentacles until the spell ends. A creature that starts its turn in the area and is already restrained by the tentacles takes 3d6 bludgeoning damage.</p><p>A creature restrained by the tentacles can use its action to make a STR or DEX check (its choice) against your spell save DC. On a success, it frees itself.</p>"
    },
    {
      "id": "blade_barrier",
      "name": "Blade Barrier",
      "tier": "6th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You create a vertical wall of whirling, razor-sharp blades made of magical energy within the spell's range. You can make a straight wall up to 100 feet long, 20 feet high, and 5 feet thick, or a ringed wall up to 60 feet in diameter, 20 feet high, and 5 feet thick. The wall provides three-quarters cover to creatures behind it, and its space is difficult terrain.</p><p>When a creature enters the wall's area for the first time on a turn or starts its turn there, the creature must make a DEX save. On a failure, the creature takes 6d10 slashing damage or half as much damage on a success.</p>"
    },
    {
      "id": "bless",
      "name": "Bless",
      "tier": "1st",
      "source": "Divine",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You bless a group of creatures with affirmation and good fortune. You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a save before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or save.</p><p><em>At Higher Tiers.</em> You can target one more creature for each additional tier.</p>"
    },
    {
      "id": "blight",
      "name": "Blight",
      "tier": "4th",
      "source": "Divine and Primordial",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>A deluge of necromantic power desiccates your target's life force. The target must make a CON save. It takes 8d8 necrotic damage on a failed save or half damage on a successful one. This spell has no effect on Undead or Constructs.</p><p>If you target a Plant creature or a magical plant, it makes the save with disadvantage, and the spell deals maximum damage to it. If you target a nonmagical plant that isn't a creature, such as a tree or shrub, it withers and dies.</p><p><em>At Higher Tiers.</em> Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "blindness_deafness",
      "name": "Blindness/Deafness",
      "tier": "2nd",
      "source": "Arcane and Divine",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V",
      "duration": "1 minute",
      "description": "<p>Your words strike your target's senses, temporarily disabling their sight or hearing. Choose one creature that you can see within range to make a CON save. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a CON save. On a success, the spell ends.</p><p><em>At Higher Tiers.</em> You can target one more creature for each additional tier.</p>"
    },
    {
      "id": "blink",
      "name": "Blink",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "1 minute",
      "description": "<p>You fade in and out, jumping rapidly between your current plane and the Ethereal. Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane (the spell fails and the casting is wasted if you were already on that plane). At the start of your next turn, and when the spell ends if you are on the Ethereal Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from. If no unoccupied space is available within that range, you appear in the nearest unoccupied space (chosen at random if more than one space is equally near). You can dismiss this spell as an action.</p><p>While on the Ethereal Plane, you can see and hear the plane you began in, which is cast in shades of gray, and you can't see anything there more than 60 feet away. You can only affect and be affected by other creatures on the Ethereal Plane. Creatures that aren't there can't perceive you or interact with you, unless they have the ability to do so.</p>"
    },
    {
      "id": "blur",
      "name": "Blur",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You take on a blurred, shifting appearance that is difficult for others to clearly discern. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn't rely on sight, as with keensense, or can see through illusions, as with truesight.</p>"
    },
    {
      "id": "branding_smite",
      "name": "Branding Smite",
      "tier": "2nd",
      "source": "Divine",
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>The next time you hit a creature with a weapon attack before this spell ends, the weapon gleams with astral radiance as you strike. The attack deals an extra 2d6 radiant damage to the target, which becomes visible if it's invisible, and the target sheds dim light in a 5-foot radius and can't become invisible until the spell ends.</p><p><em>At Higher Tiers.</em> When you cast this spell using a spell slot of 3rd tier or higher, the extra damage increases by 1d6 for each slot above 2nd.</p>"
    },
    {
      "id": "burning_hands",
      "name": "Burning Hands",
      "tier": "1st",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (15-foot cone)",
      "components": "V, S",
      "duration": null,
      "description": "<p>You release a gout of fire from your hands, blazing the area with arcane flames. Each creature in a 15-foot cone must make a DEX save. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one. The fire ignites any flammable objects in the area that aren't being worn or carried.</p><p><em>At Higher Tiers.</em> The extra damage increases by 1d6 for each additional tier.</p>"
    },
    {
      "id": "call_lightning",
      "name": "Call Lightning",
      "tier": "3rd",
      "source": "Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You conjure a local thunderstorm and control where its lightning strikes. A storm cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see 100 feet directly above you. The spell fails if you can't see a point in the air where the storm cloud could appear (for example, if you are in a room that can't accommodate the cloud).</p><p>When you cast the spell, choose a point you can see within range. A bolt of lightning flashes down from the cloud to that point. Each creature within 5 feet of that point must make a DEX save. A creature takes 3d10 lightning damage on a failed save, or half as much damage on a successful one. On each of your turns until the spell ends, you can use your action to call down lightning in this way again, targeting the same point or a different one.</p><p>If you are outdoors in stormy conditions when you cast this spell, the spell gives you control over the existing storm instead of creating a new one. Under such conditions, the spell's damage increases by 1d10.</p><p><em>At Higher Tiers.</em> Add 1d10 damage for each additional tier.</p>"
    },
    {
      "id": "calm_emotions",
      "name": "Calm Emotions",
      "tier": "2nd",
      "source": "Divine",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>With supernatural charm, you quell the riled emotions of a group of people. Each Humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a CHA save; a creature can choose to fail this save. If a creature fails its save, choose one of the following two effects:</p><ul><li><strong>Suppression.</strong> You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime.</li><li><strong>Indifference.</strong> Alternatively, you can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a spell or if it witnesses any of its friends being harmed. When the spell ends, the creature becomes hostile again, unless the GM rules otherwise.</li></ul>"
    },
    {
      "id": "chain_lightning",
      "name": "Chain Lightning",
      "tier": "6th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "150 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You create a bolt of lightning that arcs toward a target of your choice that you can see within range. Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts.</p><p>A target must make a DEX save. The target takes 10d8 lightning damage on a failed save, or half as much damage on a successful one.</p><p><em>At Higher Tiers.</em> One additional bolt leaps from the first target to another target for each additional tier.</p>"
    },
    {
      "id": "charm",
      "name": "Charm",
      "tier": "1st",
      "source": "Arcane and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You attempt to charm a creature you can see within range which understands at least one language. It makes a WIS save (with advantage if you or your companions are fighting it). On a failed save, it sees you as a friendly acquaintance until the spell ends or it is harmed. When the spell ends, the creature knows it was charmed.</p><p><em>At Higher Tiers</em>: With a 2nd-tier slot or higher, you may target one additional creature per tier. The creatures must be within 30 feet of each other. With a 4th-tier slot or higher, targeted creatures don't need to understand any languages.</p>"
    },
    {
      "id": "circle_of_death",
      "name": "Circle of Death",
      "tier": "6th",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "150 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>A sphere of negative energy ripples out in a 60-foot-radius sphere from a point within range. Each creature in that area must make a CON save. A target takes 8d6 necrotic damage on a failed save, or half as much damage on a successful one.</p><p><em>At Higher Tiers.</em> Add 2d6 damage for each additional tier.</p>"
    },
    {
      "id": "cloudkill",
      "name": "Cloudkill",
      "tier": "5th",
      "source": "Arcane and Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>A toxic cloud poisons creatures caught within it. You create a 20-foot-radius sphere of poisonous, yellow-green fog centered on a point you choose within range. The fog spreads around corners. It lasts for the duration or until strong wind disperses the fog, ending the spell. Its area is heavily obscured.</p><p>When a creature enters the spell's area for the first time on a turn or starts its turn there, that creature must make a CON save. The creature takes 5d8 poison damage on a failed save, or half as much damage on a successful one.</p><p>Creatures are affected even if they hold their breath or don't need to breathe.</p><p>The fog moves 10 feet away from you at the start of each of your turns, rolling along the surface of the ground. The vapors, being heavier than air, sink to the lowest level of the land, even pouring down openings.</p><p><em>At Higher Tiers.</em> Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "color_spray",
      "name": "Color Spray",
      "tier": "1st",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "Self (15-foot cone)",
      "components": "V, S",
      "duration": "1 round",
      "description": "<p>You shower nearby foes with blinding colors and flashing lights. Roll 6d10; the total is how many hit points of creatures this spell can affect. Creatures in a 15-foot cone originating from you are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can't see). Starting with the creature that has the lowest current hit points, each creature affected by this spell is blinded until the spell ends. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected.</p><p><em>At Higher Tiers.</em> Roll an additional 2d10 for each additional tier.</p>"
    },
    {
      "id": "command",
      "name": "Command",
      "tier": "1st",
      "source": "Divine and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You empower your spoken word with divine authority that few can resist. You speak a one-word command to a creature you can see within range. The target must succeed on a WIS save or follow the command on its next turn. The spell has no effect if the target is Undead, if it doesn't understand your language, or if your command is directly harmful to it. Some typical commands and their effects follow:</p><ul><li><strong>Approach.</strong> The target moves toward you by the shortest and most direct route, ending its turn if it moves within 5 feet of you.</li><li><strong>Drop.</strong> The target drops whatever it is holding and then ends its turn.</li><li><strong>Flee.</strong> The target spends its turn moving away from you by the fastest available means.</li><li><strong>Grovel.</strong> The target falls prone and then ends its turn.</li><li><strong>Halt.</strong> The target doesn't move and takes no actions. A flying creature stays aloft, provided that it is able to do so. If it must move to stay aloft, it flies the minimum distance needed to remain in the air.</li></ul><p><em>At Higher Tiers.</em> You can affect one more creature for each additional tier. The creatures must be within 30 feet of each other when you target them.</p>"
    },
    {
      "id": "comprehend_languages",
      "name": "Comprehend Languages",
      "tier": "1st",
      "source": "Arcane",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You understand any language you hear or read. For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text. This spell doesn't decode secret messages in a text or a glyph, such as an arcane sigil, that isn't part of a written language.</p>"
    },
    {
      "id": "compulsion",
      "name": "Compulsion",
      "tier": "4th",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Creatures of your choice that you can see within range and that can hear you must make a WIS save. A target automatically succeeds on this save if it can't be charmed. On a failed save, a target is affected by this spell. Until the spell ends, you can use a bonus action on each of your turns to designate a direction that is horizontal to you. Each affected target must use as much of its movement as possible to move in that direction on its next turn. It can take its action before it moves. After moving in this way, it can make another WIS save to try to end the effect. A target isn't compelled to move into an obviously deadly hazard, such as a fire or pit, but it will provoke opportunity attacks to move in the designated direction.</p>"
    },
    {
      "id": "cone_of_cold",
      "name": "Cone of Cold",
      "tier": "5th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (60-foot cone)",
      "components": "V, S",
      "duration": null,
      "description": "<p>A cone of biting cold air erupts from your hands, dealing significant cold damage to everyone in it. Each creature in a 60-foot cone must make a CON save. A creature takes 8d8 cold damage on a failed save, or half as much damage on a successful one. A creature killed by this spell becomes a frozen statue until it thaws.</p><p><em>At Higher Tiers.</em> Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "confusion",
      "name": "Confusion",
      "tier": "4th",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>This spell assaults and twists creatures' minds, spawning delusions and provoking uncontrolled action. Each creature in a 10-foot-radius sphere centered on a point you choose within range must succeed on a WIS save when you cast this spell or be affected by it.</p><p>An affected target can't take reactions and must roll a d10 at the start of each of its turns to determine its behavior for that turn.</p><p>At the end of each of its turns, an affected target can make a WIS save, ending the effect on itself on a success.</p><p><em>At Higher Tiers.</em> The radius increases by 5 feet for each additional tier.</p>"
    },
    {
      "id": "conjure_animals",
      "name": "Conjure Animals",
      "tier": "3rd",
      "source": "Primordial and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You conjure beasts that appear in unoccupied spaces that you can see within range. Choose one of the following options for what appears:</p><ul><li>One Beast of CR 2 or lower</li><li>Two Beasts of CR 1 or lower</li></ul><p>Conjured creatures take their turn immediately after yours and disappear if they drop to 0 HP or when the spell ends. They obey your verbal comands. If you don't give any commands, they defend themselves but otherwise take no actions.</p><p><em>At Higher Tiers</em>. The CR of the conjured creature increases by +1 at 5th, 7th, and 9th tiers. For example, you can summon one CR 5 beast using a 9th tier spell slot.</p>"
    },
    {
      "id": "conjure_elemental",
      "name": "Conjure Elemental",
      "tier": "5th",
      "source": "Arcane and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You conjure an Elemental servant that appears in an unoccupied space you can see within range. Choose which Elemental appears: an air elemental, earth elemental, a fire elemental, or a water elemental. The GM has the creature's statistics. If your GM allows it, you can use this spell to summon a different Elemental of your choice of CR 5 or lower. This spell can't conjure creatures with Legendary Actions. The creature disappears when it drops to 0 hit points or when the spell ends.</p><p>The Elemental is friendly to you and your companions for the duration. In combat, it acts on your initiative and takes its turn immediately after yours. It obeys any verbal commands that you issue to it (no action required by you). If you don't issue any commands to the Elemental, it defends itself from hostile creatures but otherwise takes no actions.</p><p><em>At Higher Tiers.</em> You can choose to conjure an Elemental of a CR equal to or below the tier of the expended slot.</p>"
    },
    {
      "id": "contagion",
      "name": "Contagion",
      "tier": "5th",
      "source": "Divine and Primordial",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "7 days",
      "description": "<p>Your touch inflicts disease. Make a melee spell attack against a creature within your reach. On a hit, you afflict the creature with a disease of your choice from the options below.</p><p>At the end of each of the target's turns, it must make a CON save. After failing three of these saves, the disease's effects last for the duration, and the creature stops making these saves. After succeeding on three of these saves, the creature recovers from the disease and the spell ends.</p><p>Since this spell induces a natural disease in its target, any effect that removes a disease or otherwise ameliorates a disease's effects applies to it.</p><ul><li><strong>Blinding Sickness.</strong> Pain grips the creature's mind, and its eyes turn milky white. The creature has disadvantage on WIS checks and WIS saves and is blinded.</li><li><strong>Filth Fever.</strong> A raging fever sweeps through the creature's body. The creature has disadvantage on STR checks, STR saves, and attack rolls that use STR.</li><li><strong>Flesh Rot.</strong> The creature's flesh decays. The creature has disadvantage on CHA checks and vulnerability to all damage.</li><li><strong>Mindfire.</strong> The creature's mind becomes feverish. The creature has disadvantage on INT checks and INT saves, and the creature behaves as if under the effects of the confusion spell during combat.</li><li><strong>Seizure.</strong> The creature is overcome with shaking. The creature has disadvantage on DEX checks, DEX saves, and attack rolls that use DEX.</li><li><strong>Slimy Doom.</strong> The creature begins to bleed uncontrollably. The creature has disadvantage on CON checks and CON saves. In addition, whenever the creature takes damage, it is stunned until the end of its next turn.</li></ul>"
    },
    {
      "id": "continual_flame",
      "name": "Continual Flame",
      "tier": "2nd",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (ruby dust worth 50 gp)",
      "duration": "Until dispelled",
      "description": "<p>You create an unending flame, producing all the light of a torch without combustion. The effect looks like a regular flame, but it creates no heat and doesn't use oxygen. A continual flame can be covered or hidden but not smothered or quenched.</p>"
    },
    {
      "id": "control_water",
      "name": "Control Water",
      "tier": "4th",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "300 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You command a body of water to flood, part, flow, or swirl. Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast this spell. As an action on your turn, you can repeat the same effect or choose a different one.</p><ul><li><strong>Flood.</strong> You cause the level of all standing water in the area to rise by as much as 20 feet. If the area includes a shore, the flooding water spills over onto dry land. If you choose an area in a large body of water, you instead create a 20-foot tall wave that travels from one side of the area to the other and then crashes down. Any Huge or smaller vehicles in the wave's path are carried with it to the other side. Any Huge or smaller vehicles struck by the wave have a 25 percent chance of capsizing. The water level remains elevated until the spell ends or you choose a different effect. If this effect produced a wave, the wave repeats on the start of your next turn while the flood effect lasts.</li><li><strong>Part Water.</strong> You separate water in the area, creating a trench in the water. The trench extends across the spell's area, and the separated water forms a wall to either side. The trench remains until the spell ends or you choose a different effect. The water then slowly fills in the trench over the course of the next round until the normal water level is restored.</li><li><strong>Redirect Flow.</strong> You cause flowing water in the area to move in a direction you choose, even if the water has to flow over obstacles, up walls, or in other unlikely directions. The water moves as you direct it, but once it moves beyond the spell's area, it resumes its flow based on terrain conditions. The water continues to move in the direction you chose until the spell ends or you choose a different effect.</li><li><strong>Whirlpool.</strong> This effect requires a body of water at least 50 feet square and 25 feet deep. You cause a whirlpool to form in the center of the area. The whirlpool forms a vortex that is 5 feet wide at the base, up to 50 feet wide at the top, and 25 feet tall. Any creature or object in the water and within 25 feet of the vortex is pulled 10 feet toward it. A creature can swim away from the vortex by making a STR (Athletics) check against your spell save DC.</li></ul><p>When a creature enters the vortex for the first time on a turn or starts its turn there, it must make a STR save. On a failed save, the creature takes 2d8 bludgeoning damage and is caught in the vortex until the spell ends. On a successful save, the creature takes half damage and isn't caught in the vortex. A creature caught in the vortex can use its action to try to swim away from the vortex as described above, but has disadvantage on the STR (Athletics) check to do so.</p><p>The first time each turn that an object enters the vortex, the object takes 2d8 bludgeoning damage; this damage occurs each round it remains in the vortex.</p>"
    },
    {
      "id": "counterspell",
      "name": "Counterspell",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Abjuration",
      "castingTime": "1 reaction, which you take when you see a creature within 60 feet of you casting a spell",
      "range": "60 feet",
      "components": "S",
      "duration": null,
      "description": "<p>You quickly call forth antithetical elements to negate another caster's magic. If the creature is casting a spell of 3rd tier or lower, its spell fails and has no effect. If it is casting a spell of 4th tier or beyond, make an ability check using your spellcasting ability. The DC equals 10 + the spell's tier. On a success, the creature's spell fails and has no effect.</p><p><em>At Higher Tiers.</em> The interrupted spell has no effect if cast at a tier less than or equal to yours.</p>"
    },
    {
      "id": "create_food_and_water",
      "name": "Create Food and Water",
      "tier": "3rd",
      "source": "Divine and Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You conjure sustenance and water to feed a small band of adventurers or their horses, but not both. You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing but spoils if uneaten after 24 hours. The water is clean and doesn't go bad.</p>"
    },
    {
      "id": "create_or_destroy_water",
      "name": "Create or Destroy Water",
      "tier": "1st",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>When you cast this spell, choose which of the following effects to create.</p><ul><li><strong>Create Water.</strong> You create up to 10 gallons of clean water within range in an open container. Alternatively, the water falls as rain in a 30-foot cube within range, extinguishing exposed flames in the area.</li><li><strong>Destroy Water.</strong> You destroy up to 10 gallons of water in an open container within range. Alternatively, you destroy fog in a 30-foot cube within range.</li></ul><p><em>At Higher Tiers.</em> For each additional tier, you create or destroy 10 additional gallons of water, or the size of the cube increases by 5 feet.</p>"
    },
    {
      "id": "cure_wounds",
      "name": "Cure Wounds",
      "tier": "1st",
      "source": "Divine and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": null,
      "description": "<p>You touch a wounded creature and heal them. They regain a number of hit points equal to 2d8 + your spellcasting ability modifier. This spell has no effect on Undead or Constructs.</p><p><em>At Higher Tiers.</em> Add +2d8 healing for each additional tier.</p>"
    },
    {
      "id": "dancing_lights",
      "name": "Dancing Lights",
      "tier": "Cantrip",
      "source": "Arcane, Primordial, and Wyrd",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You create a quartet of magical lights under your control. You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration. You can also combine the four lights into one glowing vaguely humanoid form of Medium size. Whichever form you choose, each light sheds dim light in a 10-foot radius.</p><p>As a bonus action on your turn, you can move the lights up to 60 feet to a new spot within range. A light must be within 20 feet of another light created by this spell, and a light winks out if it exceeds the spell's range.</p>"
    },
    {
      "id": "darkness",
      "name": "Darkness",
      "tier": "2nd",
      "source": "Arcane and Wyrd",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": "1 minute",
      "description": "<p>You conjure a globe of darkness that makes it impossible to see anything inside of it. It fills a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and nonmagical light won't illuminate it.</p><p>If the point you choose is on an object you are holding or one that isn't being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness.</p><p>If any of this spell's area overlaps with an area of light created by a 2nd tier spell or lower, the spell that created the light is dispelled.</p>"
    },
    {
      "id": "darkvision",
      "name": "Darkvision",
      "tier": "2nd",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 60 feet.</p>"
    },
    {
      "id": "daylight",
      "name": "Daylight",
      "tier": "3rd",
      "source": "Divine and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You conjure light as bright as day, which banishes darkness. A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet. If you choose a point on an object you are holding or one that isn't being worn or carried, the light shines from the object and moves with it. Completely covering the affected object with an opaque object, such as a bowl or a helm, blocks the light.</p><p>If any of this spell's area overlaps with an area of darkness created by a spell of 3rd tier or lower, the spell that created the darkness is dispelled.</p>"
    },
    {
      "id": "death_ward",
      "name": "Death Ward",
      "tier": "4th",
      "source": "Divine",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>Your target gains a measure of protection against death. The first time the target of this spell would drop to 0 hit points as a result of taking damage, the target instead drops to 1 hit point, and the spell ends.</p><p>If the target is subjected to an effect that would kill it instantaneously without dealing damage, that effect is instead negated against the target, and the spell ends.</p>"
    },
    {
      "id": "delayed_blast_fireball",
      "name": "Delayed Blast Fireball",
      "tier": "7th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "150 feet (20-foot-radius sphere)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>A beam of yellow light flashes from your pointing finger, then condenses to linger at a chosen point within range as a glowing bead for the duration. When the spell ends, either because your concentration is broken or because you decide to end it, the bead blossoms with a low roar into an explosion of flame that spreads around corners. Each creature in a 20-foot-radius sphere centered on that point must make a DEX save. A creature takes fire damage equal to the total accumulated damage on a failed save, or half as much damage on a successful one.</p><p>The spell's base damage is 12d6. If at the end of your turn the bead has not yet detonated, the damage increases by 1d6.</p><p>If the glowing bead is touched before the interval has expired, the creature touching it must make a DEX save. On a failed save, the spell ends immediately, causing the bead to erupt in flame. On a successful save, the creature can throw the bead up to 40 feet. When it strikes a creature or a solid object, the spell ends, and the bead explodes.</p><p>The fire damages objects in the area and ignites flammable objects that aren't being worn or carried.</p><p><em>At Higher Tiers.</em> The base damage increases by 1d6 for each additional tier.</p>"
    },
    {
      "id": "demiplane",
      "name": "Demiplane",
      "tier": "8th",
      "source": "Arcane and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "S",
      "duration": "1 hour",
      "description": "<p>You create a shadowy door on a flat solid surface that you can see within range. The door is large enough to allow Medium creatures to pass through unhindered. When opened, the door leads to a demiplane that appears to be an empty room 30 feet in each dimension, made of wood or stone. When the spell ends, the door disappears, and any creatures or objects inside the demiplane remain trapped there, as the door also disappears from the other side.</p><p>Each time you cast this spell, you can create a new demiplane, or have the shadowy door connect to a demiplane you created with a previous casting of this spell. In addition, if you know the nature and contents of a demiplane created by a casting of this spell by another creature, you can have the shadowy door connect to its demiplane instead.</p>"
    },
    {
      "id": "detect_evil_and_good",
      "name": "Detect Evil and Good",
      "tier": "1st",
      "source": "Divine and Wyrd",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You sense nearby evil or good creatures and locations. For the duration, you know if there is an Aberration, Celestial, Elemental, Fey, Fiend, or Undead within 30 feet of you, as well as where the creature is located. Similarly, you know if there is a place or object within 30 feet of you that has been magically consecrated or desecrated.</p><p>The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.</p>"
    },
    {
      "id": "detect_magic",
      "name": "Detect Magic",
      "tier": "1st",
      "source": "Arcane and Wyrd",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.</p><p>The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.</p>"
    },
    {
      "id": "detect_poison_and_disease",
      "name": "Detect Poison and Disease",
      "tier": "1st",
      "source": "Divine and Primordial",
      "school": "Divination",
      "castingTime": "1 minute (ritual)",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>For the duration, you can sense poisons, diseases, and affected creatures within 30 feet, and identify each type. This includes creatures that deal poison damage or can infect others with a disease. The spell penetrates most barriers but is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.</p>"
    },
    {
      "id": "detect_thoughts",
      "name": "Detect Thoughts",
      "tier": "2nd",
      "source": "Arcane and Wyrd",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self (30 feet)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You reach out with your intellect, sensing the minds of others and their thoughts. For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. Creatures with an INT modifier of -4 or lower or which don't speak any language are unaffected.</p><p>You initially learn the surface thoughts of the creature in that moment. As an action, you can either shift your attention to another creature's thoughts or attempt to probe deeper into the same creature's mind. If you probe deeper, the target must make a WIS save. If it fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as worries, loves, or hates).</p><p>If it succeeds, the spell ends. Either way, the target knows that you are probing into its mind, and unless you shift your attention to another creature's thoughts, the creature can use its action on its turn to make an INT check contested by your INT check; if it succeeds, the spell ends.</p><p>Questions verbally directed at the target creature naturally shape the course of its thoughts, so this spell is particularly effective as part of an interrogation.</p><p>You can also use this spell to detect the presence of thinking creatures you can't see. When you cast the spell or as your action during the duration, you can search for thoughts within 30 feet of you. The spell can penetrate barriers, but 2 feet of rock, 2 inches of any metal other than lead, or a thin sheet of lead blocks you. You can't detect a creature with an INT modifier of 4 or less or one that doesn't speak any language.</p><p>Once you detect the presence of a creature in this way, you can read its thoughts for the rest of the duration as described above, even if you can't see it, but it must still be within range.</p>"
    },
    {
      "id": "dimension_door",
      "name": "Dimension Door",
      "tier": "4th",
      "source": "Arcane and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "500 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as 200 feet straight downward or upward to the northwest at a 45-degree angle, 300 feet.</p><p>You can bring along objects as long as their weight doesn't exceed what you can carry. You can also bring one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell.</p><p>If you would arrive in a place already occupied by an object or a creature, you and any creature traveling with you each take 4d6 force damage, and the spell fails to teleport you.</p>"
    },
    {
      "id": "disguise_self",
      "name": "Disguise Self",
      "tier": "1st",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You wear an illusion that makes your appearance seem different. You make yourselfincluding your clothing, armor, weapons, and other belongings on your personlook different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.</p><p>The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.</p><p>To discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an INT (Investigation) check against your spell save DC.</p>"
    },
    {
      "id": "disintegrate",
      "name": "Disintegrate",
      "tier": "6th",
      "source": "Arcane and Wyrd",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>A thin green ray springs from your pointing finger to a target that you can see within range. The target can be a creature, an object, or a creation of magical force, such as the wall created by a wall of force spell.</p><p>A creature targeted by this spell must make a DEX save. On a failed save, the target takes 10d6 + 40 force damage. If this damage reduces the target to 0 HP, it is disintegrated.</p><p>A disintegrated creature and everything it is wearing and carrying, except magic items, are reduced to a pile of fine gray dust. The creature can be restored to life only by means of a true resurrection or a wish spell. If the target is destroyed, any magic items it was wearing or holding drop onto the ground in a space previously occupied by the target.</p><p>This spell automatically disintegrates a Large or smaller nonmagical object or a creation of magical force. If the target is a Huge or larger object or creation of force, this spell disintegrates a 10-foot-cube portion of it. A magic item is unaffected by this spell.</p><p><em>At Higher Tiers.</em> Add 3d6 damage for each additional tier.</p>"
    },
    {
      "id": "dispel_evil_and_good",
      "name": "Dispel Evil and Good",
      "tier": "5th",
      "source": "Divine and Wyrd",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Shimmering energy surrounds and protects you from certain types of creatures: Celestials, Elementals, Fey, Fiends, Undead, and creatures with the Outsider tag. Creatures of those types have disadvantage on attack rolls against you. You can end the spell early by using either of the following special functions.</p><p><strong>Break Enchantment.</strong> As your action, you touch a creature you can reach that is charmed, frightened, or possessed by one of the listed creature types. The creature you touch is no longer charmed, frightened, or possessed by such creatures.</p><p><strong>Dismissal.</strong> As your action, make a melee spell attack against a creature of one of the listed types you can reach. On a hit, you attempt to drive the creature back to its home plane. The creature must succeed on a CHA save or be sent back to its home plane (if it isn't there already) or a different plane deemed appropriate by the GM.</p>"
    },
    {
      "id": "dispel_magic",
      "name": "Dispel Magic",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You break a spell's power, ending its effects. Choose one creature, object, or magical effect within range. Any spell of 3rd tier or lower on the target ends. For each spell of 4th tier or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's tier. On a successful check, the spell ends.</p><p><em>At Higher Tiers.</em> You automatically end the effects of a spell on the target if the spell's tier is equal to or less than yours.</p>"
    },
    {
      "id": "divine_favor",
      "name": "Divine Favor",
      "tier": "1st",
      "source": "Divine",
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Your prayer empowers you with divine radiance. Until the spell ends, your weapon attacks deal an extra 1d4 radiant damage on a hit.</p>"
    },
    {
      "id": "divine_word",
      "name": "Divine Word",
      "tier": "7th",
      "source": "Divine",
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "30 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You utter a divine word, imbued with the power that shaped the world at the dawn of creation. Choose any number of creatures you can see within range. Each creature that can hear you must make a CHA save. On a failed save, a creature suffers an effect based on its current hit points:</p><ul><li>50 HP or fewer: deafened for 1 minute</li><li>40 HP or fewer: deafened and blinded for 10 minutes</li><li>30 HP or fewer: blinded, deafened, and stunned for 1 hour</li><li>20 HP or fewer: killed instantly</li></ul><p>Regardless of its current hit points, a Celestial, an Elemental, a Fey, or a Fiend that fails its save is forced back to its plane of origin (if it isn't there already) and can't return to your current plane for 24 hours by any means short of a wish spell.</p>"
    },
    {
      "id": "dominate",
      "name": "Dominate",
      "tier": "5th",
      "source": "Arcane and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Choose a Medium or smaller creature that you can see within range. This spell has no effect on creatures immune to the charmed condition. The target must succeed on a WIS save or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the save.</p><p>While the creature is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as attack that creature, run over there, or fetch that object. If the creature completes the order and doesn't receive further direction from you, it defends and preserves itself to the best of its ability.</p><p>You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose and doesn't do anything that you don't allow it to do.</p><p>During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.</p><p>Each time the target takes damage, it makes a new WIS save against the spell, ending the spell on a success.</p><p><em>At Higher Tiers.</em> The duration increases at 6th tier (10 minutes), 7th tier (1 hour), and 8th tier (8 hours).</p>"
    },
    {
      "id": "dream",
      "name": "Dream",
      "tier": "5th",
      "source": "Arcane and Wyrd",
      "school": "Illusion",
      "castingTime": "1 minute (ritual)",
      "range": "Special",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>Choose a creature known to you on the same plane of existence. You or a willing creature you touch enters a trance as the messenger, aware of surroundings but unable to act or move.</p><p>If the target is awake, the messenger knows and can end the spell or wait for the target to sleep.</p><p>If the target is asleep, the messenger appears in their dream, able to converse and shape the dream's environment. The messenger can leave the trance at any time. The target recalls the dream upon waking.</p><p>You can make the messenger appear terrifying, delivering a message of up to ten words. The target must make a WIS save. On a fail, they experience a nightmare for the duration of their sleep, gaining no benefit from rest and taking 3d6 psychic damage upon waking. The save is at disadvantage if you have a part of the target's body.</p><p>You can't cast this spell again until you complete a long rest."
    },
    {
      "id": "dreamsight",
      "name": "Dreamsight",
      "tier": "3rd",
      "source": "Arcane and Wyrd",
      "school": "Illusion",
      "castingTime": "10 minutes (ritual)",
      "range": "Special",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You enter the dreams of a creature known to you on the same plane of existence. The spell fails if the target is not asleep or meditating.</p><p>You are an imperceptible observer and you can attempt to change the dreams tone, make an object appear, or influence a creatures actions. The target must make a WIS save. On a failure, your influence succeeds. On a success, the target awakens.</p><p>While the spell lasts, your body is in repose, blind and deaf to your surroundings but aware of any damage.</p>"
    },
    {
      "id": "druidcraft",
      "name": "Druidcraft",
      "tier": "Cantrip",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You command the forces of nature to create a variety of harmless, evocative effects. You create one of the following effects within range:</p><ul><li>You create a tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round.</li><li>You instantly make a flower blossom, a seed pod open, or a leaf bud bloom.</li><li>You create an instantaneous, harmless sensory effect, such as falling leaves, a puff of wind, the sound of a small animal, or the faint odor of skunk. The effect must fit in a 5-foot cube.</li><li>You instantly light or snuff out a candle, torch, or small campfire.</li></ul>"
    },
    {
      "id": "earthquake",
      "name": "Earthquake",
      "tier": "8th",
      "source": "Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "500 feet (100-foot-radius circle)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area.</p><p>The ground in the area becomes difficult terrain. Each creature on the ground that is concentrating must make a CON save. On a failed save, the creature's concentration is broken.</p><p>When you cast this spell and at the end of each turn you spend concentrating on it, each creature on the ground in the area must make a DEX save. On a failed save, the creature is knocked prone.</p><p>This spell can have additional effects depending on the terrain in the area, as determined by the GM.</p><p><strong>Fissures.</strong> Fissures open throughout the spell's area at the start of your next turn after you cast the spell. A total of 1d6 such fissures open in locations chosen by the GM. Each is 1d10  10 feet deep, 10 feet wide, and extends from one edge of the spell's area to the opposite side. A creature standing on a spot where a fissure opens must succeed on a DEX save or fall in. A creature that successfully saves moves with the fissure's edge as it opens. A fissure that opens beneath a structure causes it to automatically collapse (see following section).</p><p><strong>Structures.</strong> The tremor deals 50 bludgeoning damage to any structure in contact with the ground in the area when you cast the spell and at the start of each of your turns until the spell ends. If a structure drops to 0 HP, it collapses and potentially damages nearby creatures. A creature within half the distance of a structure's height must make a DEX save. On a failed save, the creature takes 5d6 bludgeoning damage, is knocked prone, and is buried in the rubble, requiring a DC 20 STR (Athletics) check as an action to escape. The GM can adjust the DC higher or lower, depending on the nature of the rubble. On a successful save, the creature takes half as much damage and doesn't fall prone or become buried.</p>"
    },
    {
      "id": "elemental_blade",
      "name": "Elemental Blade",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You evoke an elemental blade in your free hand. The blade is similar in size and shape to a scimitar, and it lasts for the duration. If you let go of the blade, it disappears, but you can evoke the blade again as a bonus action. When the blade appears, you decide whether it deals acid, cold, fire, lightning, or thunder damage.</p><p>You can use your action to make a melee spell attack with the elemental blade. On a hit, the target takes 3d6 damage of the chosen type. The elemental blade sheds bright light in a 10-foot radius and dim light for an additional 10 feet.</p><p><em>At Higher Tiers.</em> Roll an additional 1d6 damage for each additional tier.</p>"
    },
    {
      "id": "elemental_shield",
      "name": "Elemental Shield",
      "tier": "4th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "10 minutes",
      "description": "<p>Elemental energy wreathes your body for the duration, shedding bright light in a 10-foot radius and dim light for an additional 10 feet. You can end the spell early by using an action to dismiss it. When the shield first appears, you decide whether it is made of acid, cold, fire, lightning, or thunder energy.</p><p>The shield grants you resistance to the damage of your chosen elemental type.</p><p>In addition, when a creature within 5 feet of you hits you with a melee attack, the shield erupts with energy. The attacker takes 2d8 damage of the chosen type.</p>"
    },
    {
      "id": "enhance_ability",
      "name": "Enhance Ability",
      "tier": "2nd",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You boost the efficacy of one of the target's six abilities, empowering it with an animal aspect. A creature you touch gains one of the following effects until the spell ends.</p><ul><li><strong>Bear's Endurance.</strong> The target has advantage on CON checks. It also gains 2d6 temporary hit points, which are lost when the spell ends.</li><li><strong>Bull's Strength.</strong> The target has advantage on STR checks, and its carrying capacity doubles.</li><li><strong>Cat's Grace.</strong> The target has advantage on DEX checks. It also doesn't take damage from falling 20 feet or less if it isn't incapacitated.</li><li><strong>Eagle's Splendor.</strong> The target has advantage on CHA checks and saves against the charmed condition.</li><li><strong>Fox's Cunning.</strong> The target has advantage on INT checks. The target also has advantage on checks made to Hide or otherwise evade notice.</li><li><strong>Owl's Wisdom.</strong> The target has advantage on WIS checks and can't be surprised.</li></ul><p><em>At Higher Tiers.</em> You can target one more creature for each additional tier.</p>"
    },
    {
      "id": "enlarge_reduce",
      "name": "Enlarge/Reduce",
      "tier": "2nd",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You change one target's size, dramatically shrinking or expanding its shape. You cause a creature or an object you can see within range to grow larger or smaller for the duration. Choose a creature or an object that is neither worn nor carried. If the target is unwilling, it can make a CON save. On a success, the spell has no effect. If the target is a creature, everything it is wearing and carrying changes size with it. Any item dropped by an affected creature returns to normal size at once.</p><p><strong>Enlarge.</strong> The target's size doubles in all dimensions, and its weight is multiplied by eight. This growth increases its size by one category from Medium to Large, for example. If there isn't enough room for the target to double its size, the creature or object attains the maximum possible size in the space available. Until the spell ends, the target also has advantage on STR checks and STR saves. The target's weapons also grow to match its new size. While these weapons are enlarged, the target's attacks with them deal 1d4 extra damage.</p><p><strong>Reduce.</strong> The target's size is halved in all dimensions, and its weight is reduced to one-eighth of normal. This reduction decreases its size by one categoryfrom Medium to Small, for example. Until the spell ends, the target also has disadvantage on STR checks and STR saves. The target's weapons also shrink to match its new size. While these weapons are reduced, the target's attacks with them deal 1d4 less damage (this can't reduce the damage below 1).</p>"
    },
    {
      "id": "entangle",
      "name": "Entangle",
      "tier": "1st",
      "source": "Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You conjure a wide knot of weeds and vines that trip up and bind creatures caught within them. These plants sprout from the ground in a 20-foot square starting from a point within range and turn the ground in the area into difficult terrain for the duration. A creature in the area when you cast the spell must succeed on a STR save or be restrained by the entangling plants until the spell ends. A creature restrained by the plants can use its action to make a STR check against your spell save DC. On a success, it frees itself. When the spell ends, the conjured plants wilt away.</p>"
    },
    {
      "id": "enthrall",
      "name": "Enthrall",
      "tier": "2nd",
      "source": "Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "1 minute",
      "description": "<p>You weave a distracting string of words, causing creatures of your choice that you can see within range and that can hear you to make a WIS save. Any creature that can't be charmed succeeds on this save automatically, and if you or your companions are fighting a creature, it has advantage on the save. On a failed save, the target has disadvantage on WIS (Perception) checks made to perceive any creature other than you until the spell ends or until the target can no longer hear you. The spell ends if you are incapacitated or can no longer speak.</p>"
    },
    {
      "id": "etherealness",
      "name": "Etherealness",
      "tier": "7th",
      "source": "Arcane and Wyrd",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Ethereal Plane for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can't see anything more than 60 feet away.</p><p>While on the Ethereal Plane, you can only affect and be affected by other creatures on that plane. Creatures that aren't on the Ethereal Plane can't perceive you and can't interact with you unless a special ability or magic has given them the ability to do so.</p><p>You ignore all objects and effects that aren't on the Ethereal Plane, allowing you to move through objects you perceive on the plane you originated from.</p><p>When the spell ends, you immediately return to the plane you originated from in the spot you currently occupy. If you occupy the same spot as a solid object or creature when this happens, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you are moved.</p><p>This spell has no effect if you cast it while you are on the Ethereal Plane or a plane that doesn't border it.</p><p><em>At Higher Tiers.</em> For each additional tier, you can target up to three more willing creatures for each additional tier within 10 feet.</p>"
    },
    {
      "id": "expeditious_retreat",
      "name": "Expeditious Retreat",
      "tier": "1st",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You gain the ability to move at an incredible pace. When you cast this spell, and then as a bonus action on each of your turns until the spell ends, you can take the Dash action.</p>"
    },
    {
      "id": "eyebite",
      "name": "Eyebite",
      "tier": "6th",
      "source": "Wyrd",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>For the spell's duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a WIS save or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can't target a creature again if it has succeeded on a save against this casting of eyebite.</p><ul><li><strong>Asleep.</strong> The target falls unconscious. It wakes up if it takes any damage or if another creature uses its action to shake the sleeper awake.</li><li><strong>Panicked.</strong> The target is frightened of you. On each of its turns, the frightened creature must take the Dash action and move away from you by the safest and shortest available route, unless there is nowhere to move. If the target moves to a place at least 60 feet away from you where it can no longer see you, this effect ends.</li><li><strong>Sickened.</strong> The target has disadvantage on attack rolls and ability checks. At the end of each of its turns, it can make another WIS save. If it succeeds, the effect ends.</li></ul>"
    },
    {
      "id": "faerie_fire",
      "name": "Faerie Fire",
      "tier": "1st",
      "source": "Wyrd",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Objects and creatures in an area are outlined with harmless, highly visible flames. Each object in a 20-foot cube within range is outlined in blue, green, or violet light (your choice). Any creature in the area when the spell is cast is also outlined in light if it fails a DEX save. For the duration, objects and affected creatures shed dim light in a 10-foot radius. Any attack roll against an affected creature or object has advantage if the attacker can see it, and the affected creature or object can't benefit from being invisible.</p>"
    },
    {
      "id": "faithful_hound",
      "name": "Faithful Hound",
      "tier": "4th",
      "source": "Divine and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>You conjure a phantom watchdog in an unoccupied space that you can see within range, where it remains for the duration, until you dismiss it as an action, or until you move more than 100 feet away from it.</p><p>The hound is invisible to all creatures except you and can't be harmed. When a Small or larger creature comes within 30 feet of it without first speaking the password that you specify when you cast this spell, the hound starts barking loudly. The hound sees invisible creatures and can see into the Ethereal Plane. It ignores illusions.</p><p>At the start of each of your turns, the hound attempts to bite one creature within 5 feet of it that is hostile to you. The hound's attack bonus is equal to your spellcasting ability modifier + your PB. On a hit, it deals 4d8 piercing damage.</p>"
    },
    {
      "id": "false_life",
      "name": "False Life",
      "tier": "1st",
      "source": "Arcane",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You imbue yourself with a wellspring of vitality. Bolstering yourself with a necromantic facsimile of life, you gain 1d4 + 4 temporary HP for the duration.</p><p><em>At Higher Tiers.</em> You gain 5 more HP for each additional tier.</p>"
    },
    {
      "id": "fear",
      "name": "Fear",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "Self (30-foot cone)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You project a phantasmal image of a creature's worst fears. Each creature in a 30-foot cone must succeed on a WIS save or drop whatever it is holding and become frightened for the duration.</p><p>While frightened by this spell, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move. If the creature ends its turn in a location where it doesn't have line of sight to you, the creature can make a WIS save. On a successful save, the spell ends for that creature.</p>"
    },
    {
      "id": "feather_fall",
      "name": "Feather Fall",
      "tier": "1st",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 reaction, which you take when you or a creature within 60 feet of you falls",
      "range": "30 feet",
      "components": "V",
      "duration": "1 minute",
      "description": "<p>You quickly turn a hard fall into a gentle descent. Choose up to five falling creatures within range. A falling creature's rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature.</p>"
    },
    {
      "id": "feeblemind",
      "name": "Feeblemind",
      "tier": "8th",
      "source": "Arcane",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "150 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You blast the mind of a creature that you can see within range, attempting to shatter its intellect and personality. The target takes 4d6 psychic damage and must make an INT save.</p><p>On a failed save, the creature's INT and CHA become -5. The creature can't cast spells, activate magic items, understand language, or communicate in any intelligible way. However, the creature can identify its friends, follow them, and even protect them.</p><p>At the end of every 30 days, the creature can repeat its save against this spell, ending the spell on a success.</p><p>The spell can also be ended by the greater restoration, heal, or wish spells.</p>"
    },
    {
      "id": "finger_of_death",
      "name": "Finger of Death",
      "tier": "7th",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You send negative energy coursing through a creature that you can see within range, causing it searing pain. The target must make a CON save. It takes 7d8 + 30 necrotic damage on a failed save, or half as much damage on a success.</p><p>A Humanoid killed by this spell rises as a zombie at the start of your next turn. The zombie is permanently under your command and follows your verbal orders to the best of its ability.</p>"
    },
    {
      "id": "fire_bolt",
      "name": "Fire Bolt",
      "tier": "Cantrip",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You send a bolt of fire blazing toward your target. Make a ranged spell attack against a target within range. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn't being worn or carried.</p><p>This spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).</p>"
    },
    {
      "id": "fire_storm",
      "name": "Fire Storm",
      "tier": "7th",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "150 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>A storm made up of sheets of roaring flame appears in a location you choose within range. The area of the storm consists of up to ten 10-foot cubes, which you can arrange as you wish. Each cube must have at least one face adjacent to the face of another cube.</p><p>Each creature in the area must make a DEX save. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one.</p><p>The fire damages objects in the area and ignites flammable objects that aren't being worn or carried. If you choose, plant life in the area is unaffected by this spell.</p>"
    },
    {
      "id": "fireball",
      "name": "Fireball",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You hurl a small ball of flame that roars into an explosion of flame. Each creature in a 20-foot-radius sphere centered on a point within range must make a DEX save. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.</p><p>The fire spreads around corners. It ignites flammable objects in the area that aren't being worn or carried.</p><p><em>At Higher Tiers.</em> Add 1d6 damage for each additional tier.</p>"
    },
    {
      "id": "flame_strike",
      "name": "Flame Strike",
      "tier": "5th",
      "source": "Divine",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot-radius, 40-foot-high cylinder centered on a point within range must make a DEX save. A creature takes 4d6 fire damage and 4d6 radiant damage on a failed save, or half as much damage on a success.</p><p><em>At Higher Tiers.</em> Add 1d6 damage fire or radiant damage (your choice) for each additional tier.</p>"
    },
    {
      "id": "flaming_sphere",
      "name": "Flaming Sphere",
      "tier": "2nd",
      "source": "Arcane and Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You conjure a roiling ball of flame that acts on your command. A 5-foot-diameter sphere of fire appears in an unoccupied space of your choice within range and lasts for the duration. Any creature that ends its turn within 5 feet of the sphere must make a DEX save. The creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.</p><p>As a bonus action, you can move the sphere up to 30 feet. If you ram the sphere into a creature, that creature must make the save against the sphere's damage, and the sphere stops moving this turn.</p><p>When you move the sphere, you can direct it over barriers up to 5 feet tall and jump it across pits up to 10 feet wide.</p><p>The sphere ignites flammable objects not being worn or carried, and it sheds bright light in a 20-foot radius and dim light for an additional 20 feet.</p><p><em>At Higher Tiers.</em> Add 1d6 damage for each additional tier.</p>"
    },
    {
      "id": "flesh_to_stone",
      "name": "Flesh to Stone",
      "tier": "6th",
      "source": "Divine",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You attempt to turn one creature that you can see within range into stone. If the target's body is made of flesh, the creature must make a CON save. On a failed save, it is restrained as its flesh begins to harden. On a successful save, the creature isn't affected.</p><p>A creature restrained by this spell must make another CON save at the end of each of its turns. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to stone and subjected to the petrified condition for the duration. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.</p><p>If the creature is physically broken while petrified, it suffers from similar damage if it reverts to its original state, automatically dying if it can't survive without the damaged body part (such as the head or other area of the body with vital organs).</p><p>If you maintain your concentration on this spell for the entire possible duration, the creature is turned to stone until the effect is removed.</p>"
    },
    {
      "id": "floating_disk",
      "name": "Floating Disk",
      "tier": "1st",
      "source": "Arcane",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>This spell creates a circular, horizontal plane of force, 3 feet in diameter and 1 inch thick, that floats 3 feet above the ground in an unoccupied space of your choice that you can see within range. The disk remains for the duration and can hold up to 500 pounds. If more weight is placed on it, the spell ends, and everything on the disk falls to the ground.</p><p>The disk is immobile while you are within 20 feet of it. If you move more than 20 feet away from it, the disk follows you so that it remains within 20 feet of you. It can move across uneven terrain, up or down stairs, slopes, and the like, but it can't cross an elevation change of 10 feet or more. For example, the disk can't move across a 10 foot deep pit, nor could it leave such a pit if it was created at the bottom.</p><p>If you move more than 100 feet from the disk (typically because it can't move around an obstacle to follow you), the spell ends.</p>"
    },
    {
      "id": "fly",
      "name": "Fly",
      "tier": "3rd",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You grant the power of flight. A willing creature you touch gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall.</p><p><em>At Higher Tiers.</em> You can target one more creature for each additional tier.</p>"
    },
    {
      "id": "fog_cloud",
      "name": "Fog Cloud",
      "tier": "1st",
      "source": "Arcane and Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You conjure a thick mist that hangs in the air, obscuring sightlines. You create a 20-foot-radius sphere of fog centered on a point within range. The sphere spreads around corners, and its area is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.</p><p><em>At Higher Tiers.</em> The fog's radius increases by 20 feet for each additional tier.</p>"
    },
    {
      "id": "forcecage",
      "name": "Forcecage",
      "tier": "7th",
      "source": "Arcane and Wyrd",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "100 feet",
      "components": "V, S, M (ruby dust worth 1,500 gp)",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range. The prison can be a cage or a solid box (your choice).</p><p>A prison in the shape of a cage can be up to 20 feet on a side and is made from 1/2-inch-diameter bars spaced 1/2 inch apart.</p><p>A prison in the shape of a box can be up to 10 feet on a side, creating a solid barrier that prevents any matter from passing through it and blocking any spells cast into or out from the area.</p><p>When you cast the spell, any creature that is completely inside the cage's area is trapped. Creatures only partially within the area and those too large to fit inside the area are pushed away from the center of the area until they are completely outside it.</p><p>A creature inside the cage can't leave it by nonmagical means. If the creature tries to use a spell or any other magical means of teleportation or interplanar travel to leave the cage, it must first make a CHA save. On a success, the creature can use that magic to exit the cage. On a failure, the creature can't exit the cage and wastes the use of the spell or effect. The cage also extends into the Ethereal Plane, blocking ethereal travel.</p><p>This spell can't be dispelled by dispel magic.</p>"
    },
    {
      "id": "four_winds",
      "name": "Four Winds",
      "tier": "7th",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S, M (an ivory war horn worth 500 gp)",
      "duration": "1 minute",
      "description": "<p>You stir the air to create four whirlwinds on the ground at points you can see within range. Each whirlwind is a 5-foot-radius, 30-foot-tall cylinder of swirling air centered on that point. The whirlwinds last for the duration of the spell.</p><p>Each creature that enters a space occupied by a whirlwind for the first time on a turn (including when the whirlwinds first appear) or starts its turn in a space occupied by a whirlwind must make a STR save. On a failed save, a Large or smaller creature takes 4d10 bludgeoning damage and is thrown up to 60 feet in a random direction and knocked prone. On a failed save, a Huge or larger creature takes the bludgeoning damage and is not thrown but is restrained until the beginning of its next turn. On a successful save, creatures of any size take only half as much damage and are pushed out of the whirlwind into a random unoccupied space within 5 feet of the whirlwind.</p><p>If a thrown creature strikes a solid surface, it takes 1d6 bludgeoning damage for every 10 feet it is thrown. If the creature is thrown at another creature, the hit creature must succeed on a DEX save against your spell save DC or take the same damage as the thrown creature and be knocked prone. If a thrown creature is thrown into another whirlwind, it is then thrown from the new whirlwind up to 60 feet again in a random direction.</p><p>At the start of each of your turns after the whirlwinds first appear, you can use your action to control them, moving each one up to 30 feet in a direction you choose. If you can't use your action or choose not to use your action to control the whirlwinds, each whirlwind moves up to 30 feet in a random direction, potentially affecting you along with any other creatures it encounters. If multiple whirlwinds would end their turn in the same space or overlapping spaces, one whirlwind moves to the space, and the other moves to the nearest adjacent space not occupied by a whirlwind.</p><p>You can use an action to end the spell early, which causes the whirlwinds to disappear. The spell also ends early if you are incapacitated or die.</p>"
    },
    {
      "id": "freedom_of_movement",
      "name": "Freedom of Movement",
      "tier": "4th",
      "source": "Arcane, Divine, and Primordial",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You enable a target to evade and ignore attempts to confine their movement. You touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain. Spells and other magical effects can neither reduce the target's speed nor cause it to be paralyzed or restrained.</p><p>The target can also spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature that has it grappled. Finally, being underwater imposes no penalties on the target's movement or attacks.</p>"
    },
    {
      "id": "freezing_sphere",
      "name": "Freezing Sphere",
      "tier": "6th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "300 feet (60-foot-radius sphere)",
      "components": "V, S",
      "duration": null,
      "description": "<p>A frigid globe of cold energy streaks from your fingertips to a point of your choice within range, where it explodes in a 60-foot-radius sphere. Each creature within the area must make a CON save. A creature takes 10d6 cold damage on a failed save, or half as much damage on a successful one.</p><p>If the globe strikes a body of water or a liquid that is principally water (not including water-based creatures), it freezes the liquid to a depth of 6 inches over an area 30 feet square. This ice lasts for 1 minute. Creatures that were swimming on the surface of frozen water are trapped in the ice. A trapped creature can use an action to make a STR check against your spell save DC to break free.</p><p>You can refrain from firing the globe after completing the spell, if you wish. A small globe about the size of a sling stone, cool to the touch, appears in your hand. At any time, you, or a creature you give the globe to, can throw the globe (to a range of 40 feet) or hurl it with a sling (to the sling's normal range). It shatters on impact, with the same effect as the normal casting of the spell. You can also set the globe down without shattering it. After 1 minute, if the globe hasn't already shattered, it explodes.</p><p><em>At Higher Tiers.</em> Add 1d6 damage for each additional tier.</p>"
    },
    {
      "id": "gaseous_form",
      "name": "Gaseous Form",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>Your target transforms into a free-floating cloud of gas. You transform a willing creature you touch, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn't affected.</p><p>While in this form, the target's only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target has resistance to nonmagical damage, and it has advantage on STR, DEX, and CON saves. The target can pass through small holes, narrow openings, and even mere cracks, though it treats liquids as though they were solid surfaces. The target can't fall and remains hovering in the air even when stunned or otherwise incapacitated. The target can't talk or manipulate objects, and any objects it was carrying or holding can't be dropped, used, or otherwise interacted with. The target can't attack or cast spells.</p>"
    },
    {
      "id": "gate",
      "name": "Gate",
      "tier": "9th",
      "source": "Arcane and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S, M (a diamond worth 5,000 gp)",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration.</p><p>The portal has a front and a back on each plane where it appears. Travel through the portal is possible only by moving through its front. Anything that does so is instantly transported to the other plane, appearing in the unoccupied space nearest to the portal.</p><p>Deities and other planar rulers can prevent portals created by this spell from opening in their presence or anywhere within their domains.</p><p>When you cast this spell, you can speak the name of a specific creature (a pseudonym, title, or nickname doesn't work). If that creature is on a plane other than the one you are on, the portal opens in the named creature's immediate vicinity and draws the creature through it to the nearest unoccupied space on your side of the portal. You gain no special power over the creature, and it is free to act as the GM deems appropriate. It might leave, attack you, or help you.</p>"
    },
    {
      "id": "gear_barrage",
      "name": "Gear Barrage",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "Self (60-foot cone)",
      "components": "V, S, M (a handful of gears worth 5 gp)",
      "duration": null,
      "description": "<p>You conjure a burst of magically propelled gears. Each creature in a 60-foot cone takes 3d8 slashing damage, or half as much damage with a successful DEX save. Constructs have disadvantage on this save.</p><p><em>At Higher Tiers.</em> Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "gentle_repose",
      "name": "Gentle Repose",
      "tier": "2nd",
      "source": "Arcane and Divine",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (one copper piece placed on each of the corpse's eyes for the duration)",
      "duration": "10 days",
      "description": "<p>You ward a cadaver against necromantic magic and powers. You touch a corpse or other remains. For the duration, the target is protected from decay and can't become Undead.</p><p>The spell also effectively extends the time limit on raising the target from the dead, since days spent under the influence of this spell don't count against the time limit of spells such as raise dead.</p>"
    },
    {
      "id": "giant_insect",
      "name": "Giant Insect",
      "tier": "4th",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You transform up to ten centipedes, three spiders, five wasps, or one scorpion within range into giant versions of their natural forms for the duration. A centipede becomes a giant centipede, a spider becomes a giant spider, a wasp becomes a giant wasp, and a scorpion becomes a giant scorpion.</p><p>Each creature obeys your verbal commands, and in combat, they act on your turn each round. The GM has the statistics for these creatures and resolves their actions and movement.</p><p>A creature remains in its giant size for the duration, until it drops to 0 HP, or until you use an action to dismiss the effect on it.</p><p>The GM might allow you to choose different targets. For example, if you transform a bee, its giant version might have the same statistics as a giant wasp.</p>"
    },
    {
      "id": "glibness",
      "name": "Glibness",
      "tier": "8th",
      "source": "Arcane and Divine",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>Until the spell ends, when you make a CHA ability check or save, you can replace the number you roll with a 15. In addition, no matter what you say, magic that would determine if you are telling the truth indicates that you are being truthful.</p>"
    },
    {
      "id": "globe_of_invulnerability",
      "name": "Globe of Invulnerability",
      "tier": "6th",
      "source": "Arcane",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self (10-foot radius)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>An immobile, faintly shimmering barrier springs into existence in a 10-foot radius around you and remains for the duration.</p><p>Spell attacks that originate from a creature outside the barrier or any spell of 5th tier or lower cast from outside the barrier can't affect creatures or objects within it, even if the spell is cast using a higher tier spell slot. Such a spell attack or spell can target creatures and objects within the barrier, but the spell attack or spell has no effect on them.</p><p>Similarly, the area within the barrier is excluded from the areas affected by such spells.</p><p><em>At Higher Tiers.</em> For each additional tier, the barrier blocks spells of one tier higher.</p>"
    },
    {
      "id": "goodberry",
      "name": "Goodberry",
      "tier": "1st",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": null,
      "description": "<p>You create a handful of nutritious berries that heal small wounds and fill hungry bellies. Up to ten berries appear in your hand. A creature can use its action to eat one berry. Eating a berry restores 1 HP and provides enough nourishment to sustain a creature for one day. The berries lose their potency if they have not been consumed within 24 hours of the casting of this spell.</p>"
    },
    {
      "id": "grave_touch",
      "name": "Grave Touch",
      "tier": "Cantrip",
      "source": "Arcane and Wyrd",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "1 round",
      "description": "<p>You create a death grip to assail your target's life force. Make a ranged spell attack against a creature within range to assail it with the chill of the grave. On a hit, the target takes 1d8 necrotic damage, and it can't regain hit points until the start of your next turn. Until then, the hand clings to the target.</p><p>If you hit an Undead target, it has disadvantage on attack rolls against you until the end of your next turn.</p><p>This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>"
    },
    {
      "id": "grease",
      "name": "Grease",
      "tier": "1st",
      "source": "Arcane",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "1 minute",
      "description": "<p>You conjure a large puddle of slippery grease that is difficult to stand in. Slick grease covers the ground in a 10-foot square centered on a point within range and turns it into difficult terrain for the duration.</p><p>When the grease appears, each creature standing in its area must succeed on a DEX save or fall prone. A creature that enters the area or ends its turn there must also succeed on a DEX save or fall prone.</p>"
    },
    {
      "id": "greater_dominate",
      "name": "Greater Dominate",
      "tier": "8th",
      "source": "Arcane and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You attempt to beguile any creature that you can see within range. This spell has no effect on creatures immune to the charmed condition. The target must succeed on a WIS save or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the save.</p><p>While the creature is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as attack that creature, run over there, or fetch that object. If the creature completes the order and doesn't receive further direction from you, it defends and preserves itself to the best of its ability.</p><p>You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose and doesn't do anything that you don't allow it to do.</p><p>During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.</p><p>Each time the target takes damage, it makes a new WIS save against the spell, ending the spell on a success.</p><p><em>At Higher Tiers.</em> At 9th tier, the duration is concentration up to 8 hours.</p>"
    },
    {
      "id": "greater_hold",
      "name": "Greater Hold",
      "tier": "5th",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Choose any creature that you can see within range. The target must succeed on a WIS save or be paralyzed for the duration. At the end of each of its turns, an affected target can repeat the WIS save, ending the effect on itself on a success. This spell has no effect on Undead.</p><p><em>At Higher Tiers.</em> You can target one more creature for each additional tier. They must be within 30 feet of each other when you target them.</p>"
    },
    {
      "id": "greater_invisibility",
      "name": "Greater Invisibility",
      "tier": "4th",
      "source": "Arcane and Wyrd",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person.</p>"
    },
    {
      "id": "greater_restoration",
      "name": "Greater Restoration",
      "tier": "5th",
      "source": "Divine and Primordial",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (diamond dust worth 100 gp, which the spell consumes)",
      "duration": null,
      "description": "<p>You stop a significant condition or debilitating effect on a creature. You can reduce the target's exhaustion level by one, or end one of the following effects on the target:</p><p>One effect that charmed or petrified the target</p><p>One curse, including the target's attunement to a cursed magic item</p><p>Any reduction to one of the target's ability scores</p><p>One effect reducing the target's hit point maximum</p>"
    },
    {
      "id": "guardian_of_faith",
      "name": "Guardian of Faith",
      "tier": "4th",
      "source": "Divine",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V",
      "duration": "8 hours",
      "description": "<p>A Large spectral guardian appears and hovers for the duration in an unoccupied space of your choice that you can see within range. The guardian occupies that space and is indistinct except for a gleaming sword and shield emblazoned with the symbol of your faith.</p><p>Any creature hostile to you that moves to a space within 10 feet of the guardian for the first time on a turn must succeed on a DEX save. The creature takes 20 radiant damage on a failed save, or half as much damage on a successful one. The guardian vanishes when it has dealt a total of 60 damage.</p>"
    },
    {
      "id": "guidance",
      "name": "Guidance",
      "tier": "Cantrip",
      "source": "Divine",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You bestow a brief moment of spiritual guidance in your target's next endeavor. You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends.</p>"
    },
    {
      "id": "guiding_bolt",
      "name": "Guiding Bolt",
      "tier": "1st",
      "source": "Divine",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "1 round",
      "description": "<p>You send a flash of light streaking toward a creature, making them easier to target. Make a ranged spell attack against a target within range. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then.</p><p><em>At Higher Tiers.</em> Add 1d6 damage for each additional tier.</p>"
    },
    {
      "id": "gust_of_wind",
      "name": "Gust of Wind",
      "tier": "2nd",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (60-foot line)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You bring forth a continuous blast of wind that blows back nigh everything in your path. A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration. Each creature that starts its turn in the line must succeed on a STR save or be pushed 15 feet away from you in a direction following the line. Any creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you.</p><p>The gust disperses gas or vapor, and extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them.</p><p>As a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you.</p>"
    },
    {
      "id": "hallucination",
      "name": "Hallucination",
      "tier": "2nd",
      "source": "Arcane and Wyrd",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "60 feet (10 ft cube)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You create a vivid hallucination in the mind of a target you can see, or whose mind you can sense. The target must make an INT saving throw. On a failed save, you create a phenomenon perceivable only to the target. The effect must fit within a ten-foot cube and can include sound, temperature, and other stimuli. It has no effect on undead or constructs.</p><p>While affected, the target treats the hallucination as real, rationalizing any illogical outcomes. It can deal 1d6 psychic damage each round if it appears as a creature or hazard capable of dealing damage. The target perceives the damage as appropriate to the illusion: taking fire damage from lava, for example.</p><p>The target can use its action to make an Investigation check against your spell save DC. On a success, the target realizes the hallucination is false, ending the spell.</p>"
    },    
    {
      "id": "harm",
      "name": "Harm",
      "tier": "6th",
      "source": "Divine and Wyrd",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You unleash a virulent disease on a creature that you can see within range. The target must make a CON save. On a failure, it takes 14d6 necrotic damage, or half as much damage on a success. The damage can't reduce the target's hit points below 1. If the target fails the save, its hit point maximum is reduced for 1 hour by an amount equal to the necrotic damage it took. Any effect that removes a disease allows a creature's hit point maximum to return to normal before that time passes.</p>"
    },
    {
      "id": "haste",
      "name": "Haste",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You imbue your target with swiftness, making them hard to hit and faster to hit back. Choose a willing creature that you can see within range. Until the spell ends, the target's speed is doubled, it gains a +2 bonus to AC, it has advantage on DEX saves, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.</p><p>When the spell ends, the target can't move or take actions until after its next turn, as a wave of lethargy sweeps over it.</p>"
    },
    {
      "id": "heal",
      "name": "Heal",
      "tier": "6th",
      "source": "Divine and Primordial",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>Choose a creature that you can see within range. A surge of positive energy washes through the creature, causing it to regain 70 HP. This spell also ends blindness, deafness, and any diseases affecting the target. This spell has no effect on Constructs or Undead.</p><p><em>At Higher Tiers.</em> Add 10 HP for each additional tier.</p>"
    },
    {
      "id": "healing_word",
      "name": "Healing Word",
      "tier": "1st",
      "source": "Divine",
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "60 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You say a quick prayer that knits small wounds on a nearby target. A creature of your choice that you can see within range regains hit points equal to 2d4 + your spellcasting ability modifier. This spell has no effect on Undead or Constructs.</p><p><em>At Higher Tiers.</em> Add +2d4 healing for each additional tier.</p>"
    },
    {
      "id": "heat_metal",
      "name": "Heat Metal",
      "tier": "2nd",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You cause a nearby metal object to superheat, harming anyone in contact with it. Choose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes 2d8 fire damage when you cast the spell. Until the spell ends, you can use a bonus action on each of your subsequent turns to cause this damage again.</p><p>If a creature is holding or wearing the object and takes the damage from it, the creature must succeed on a CON save or drop the object if it can. If it doesn't drop the object, it has disadvantage on attack rolls and ability checks until the start of your next turn.</p><p><em>At Higher Tiers.</em> Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "hellish_rebuke",
      "name": "Hellish Rebuke",
      "tier": "1st",
      "source": "Wyrd",
      "school": "Evocation",
      "castingTime": "1 reaction, when damaged by a creature within 60 feet of you that you can see",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You point your finger, and the creature that damaged you is momentarily surrounded by hellish flames. The creature must make a DEX save. It takes 2d10 fire damage on a failed save, or half as much damage on a successful one.</p><p><em>At Higher Tiers.</em> Add 1d10 damage for each additional tier.</p>"
    },
    {
      "id": "heroism",
      "name": "Heroism",
      "tier": "1st",
      "source": "Divine",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>A willing creature you touch is imbued with bravery. Until the spell ends, the creature is immune to being frightened and gains temporary hit points equal to your spellcasting ability modifier at the start of each of its turns. When the spell ends, the target loses any remaining temporary hit points from this spell.</p><p><em>At Higher Tiers.</em> You can target one more creature for each additional tier.</p>"
    },
    {
      "id": "hideous_laughter",
      "name": "Hideous Laughter",
      "tier": "1st",
      "source": "Arcane and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You ensorcel your target with uncontrollable laughter. The target must succeed on a WIS save or fall prone, becoming incapacitated and unable to stand up for the duration. A creature with an INT modifier of 4 or less isn't affected.</p><p>At the end of each of its turns, and each time it takes damage, the target can make another WIS save. The target has advantage on the save if it's triggered by damage. On a success, the spell ends.</p>"
    },
    {
      "id": "hold",
      "name": "Hold",
      "tier": "2nd",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Choose a Medium or smaller creature that you can see within range. The target must succeed on a WIS save or be paralyzed for the duration. At the end of each of its turns, an affected target can repeat the WIS save, ending the effect on itself on a success. This spell has no effect on Undead.</p><p><em>At Higher Tiers.</em> You can target one more creature for each additional tier. They must be within 30 feet of each other when you target them.</p>"
    },
    {
      "id": "holy_aura",
      "name": "Holy Aura",
      "tier": "8th",
      "source": "Divine",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M (a tiny reliquary worth 1,000 gp)",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Divine light washes out from you and coalesces in a soft radiance in a 30-foot radius around you. Creatures of your choice in that radius when you cast this spell shed dim light in a 5-foot radius and have advantage on all saves, and other creatures have disadvantage on attack rolls against them until the spell ends. In addition, when a Fiend or an Undead hits an affected creature with a melee attack, the aura flashes with brilliant light. The attacker must succeed on a CON save or be blinded until the spell ends.</p>"
    },
    {
      "id": "hypnotic_pattern",
      "name": "Hypnotic Pattern",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You create a swathe of mesmerizing colors that bewitches any creature caught looking. You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a WIS save. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0.</p><p>The spell ends for an affected creature if it takes any damage or if someone else uses an action to shake the creature out of its stupor.</p>"
    },
    {
      "id": "ice_storm",
      "name": "Ice Storm",
      "tier": "4th",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "300 feet",
      "components": "S",
      "duration": null,
      "description": "<p>A torrent of hailstones deals significant damage and briefly creates difficult terrain. The storm impacts a 20-foot-radius, 40-foot-high cylinder centered on a point within range. Each creature in the cylinder must make a DEX save. A creature takes 2d8 bludgeoning damage and 4d6 cold damage on a failed save, or half damage on a successful one.</p><p>Hailstones turn the storm's area of effect into difficult terrain until the end of your next turn.</p><p><em>At Higher Tiers.</em> Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "incendiary_cloud",
      "name": "Incendiary Cloud",
      "tier": "8th",
      "source": "Arcane",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "150 feet (20-foot-radius sphere)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>A swirling cloud of smoke shot through with white-hot embers appears in a 20-foot-radius sphere centered on a point within range. The cloud spreads around corners and is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.</p><p>When the cloud appears, each creature in it must make a DEX save. A creature takes 10d8 fire damage on a failed save, or half as much damage on a successful one. A creature must also make this save when it enters the spell's area for the first time on a turn or ends its turn there.</p><p>The cloud moves 10 feet directly away from you in a direction that you choose at the start of each of your turns.</p>"
    },
    {
      "id": "inflict_wounds",
      "name": "Inflict Wounds",
      "tier": "1st",
      "source": "Divine and Wyrd",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": null,
      "description": "<p>Your pale, sickly hand threatens grievous harm upon whomever you touch. Make a melee spell attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage.</p><p><em>At Higher Tiers.</em> Add 1d10 damage for each additional tier.</p>"
    },
    {
      "id": "insect_plague",
      "name": "Insect Plague",
      "tier": "5th",
      "source": "Divine and Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "300 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You summon a swarm of locusts, creating difficult terrain and damaging anyone caught within their mass. The swarm fills a 20-foot-radius sphere centered on a point you choose within range and it spreads around corners. The sphere remains for the duration, its area is lightly obscured, and its area is difficult terrain.</p><p>When the area appears, each creature in it must make a CON save. A creature takes 4d10 piercing damage on a failed save, or half damage on a successful one. A creature must also make this save when it enters the spell's area for the first time on a turn or ends its turn there.</p><p><em>At Higher Tiers.</em> Add 1d10 damage for each additional tier.</p>"
    },
    {
      "id": "invisibility",
      "name": "Invisibility",
      "tier": "2nd",
      "source": "Arcane and Wyrd",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>With a touch, your target disappears from sight. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for a target that attacks or casts a spell.</p><p><em>At Higher Tiers.</em> You can target one more creature for each additional tier.</p>"
    },
    {
      "id": "irresistible_dance",
      "name": "Irresistible Dance",
      "tier": "6th",
      "source": "Arcane and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Choose one creature that you can see within range. The target begins a comic dance in place: shuffling, tapping its feet, and capering for the duration. Creatures that can't be charmed are immune to this spell.</p><p>A dancing creature must use all its movement to dance without leaving its space and has disadvantage on DEX saves and attack rolls. While the target is affected by this spell, other creatures have advantage on attack rolls against it. As an action, a dancing creature can make a WIS save to regain control of itself. On a successful save, the spell ends.</p>"
    },
    {
      "id": "jump",
      "name": "Jump",
      "tier": "1st",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "1 minute",
      "description": "<p>You touch a creature. The creature's jump distance is tripled until the spell ends.</p>"
    },
    {
      "id": "knock",
      "name": "Knock",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You cause a targeted object to unlock, unstick, or unbar itself. Choose an object that you can see within range. The object can be a door, a box, a chest, a set of manacles, a padlock, or another object that contains a mundane or magical means that prevents access. A target that is held shut by a mundane lock or that is stuck or barred becomes unlocked, unstuck, or unbarred.</p><p>If the object has multiple locks, only one of them is unlocked. If you choose a target that is held shut with arcane lock, that spell is suppressed for 10 minutes, during which time the target can be opened and shut normally.</p><p>When you cast the spell, a loud knock, audible from as far away as 300 feet, emanates from the target object.</p>"
    },
    {
      "id": "legend_lore",
      "name": "Legend Lore",
      "tier": "5th",
      "source": "Arcane and Divine",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M (incense worth 250 gp, which the spell consumes)",
      "duration": null,
      "description": "<p>Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named. The lore might consist of current tales, forgotten stories, or even secret lore that has never been widely known. If the thing you named isn't of legendary importance, you gain no information.</p><p>The more information you already have about the thing, the more precise and detailed the information you receive is. The information you learn is accurate but might be couched in figurative language.</p>"
    },
    {
      "id": "levitate",
      "name": "Levitate",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You cause your target to hover in the air, untethered by gravity. One creature or object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 500 pounds. An unwilling creature that succeeds on a CON save is unaffected.</p><p>The target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows it to move as if it were climbing. You can change the target's altitude by up to 20 feet in either direction on your turn. If you are the target, you can move up or down as part of your move. Otherwise, you can use your action to move the target, which must remain within the spell's range.</p><p>When the spell ends, the target floats gently to the ground if it is still aloft.</p>"
    },
    {
      "id": "light",
      "name": "Light",
      "tier": "Cantrip",
      "source": "Arcane and Divine",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You cause bright light to spring forth from whatever you touch. You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light.</p><p>The spell ends if you cast it again or dismiss it as an action.</p><p>If you target an object held or worn by a hostile creature, that creature must succeed on a DEX save to avoid the spell.</p>"
    },
    {
      "id": "lightning_bolt",
      "name": "Lightning Bolt",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (100-foot line)",
      "components": "V, S",
      "duration": null,
      "description": "<p>You send a streaking bolt of electricity lancing out from your person. A stroke of lightning forming a line 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a DEX save. A creature takes 8d6 lightning damage on a failed save, or half as much damage on a successful one. The lightning ignites flammable objects in the area that aren't being worn or carried.</p><p><em>At Higher Tiers.</em> Add 1d6 damage for each additional tier.</p>"
    },
    {
      "id": "locate",
      "name": "Locate",
      "tier": "2nd",
      "source": "Arcane, Divine, Primordial, and Wyrd",
      "school": "Divination",
      "castingTime": "1 minute (ritual)",
      "range": "Self (1 mile)",
      "components": "V, S, M (25 gp figurine which the spell consumes)",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>Describe or name a kind of object or creature. If within range, you sense the direction to the nearest target of that type. If it moves, you know the direction of its movement.</p><p>The spell can't locate a creature or object if it has transformed or is shielded by divination-blocking magic.</p><p><em>At Higher Tiers</em>: With 4th-tier spell slots, you can locate a specific familiar creature or object and the spell lasts up to 1 hour.</p>"
    },
    {
      "id": "longstrider",
      "name": "Longstrider",
      "tier": "1st",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>Your touch grants a burst of fleetness to your target. The target's speed increases by 10 feet and its jump distance is tripled until the spell ends.</p><p><em>At Higher Tiers.</em> You can target one more creature for each additional tier.</p>"
    },
    {
      "id": "mage_armor",
      "name": "Mage Armor",
      "tier": "1st",
      "source": "Arcane",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>You weave invisible defenses around your target. You touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends. The target's base AC becomes 13 + its DEX modifier. The spell ends if the target dons armor or if you dismiss the spell as an action.</p>"
    },
    {
      "id": "mage_hand",
      "name": "Mage Hand",
      "tier": "Cantrip",
      "source": "Arcane and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "1 minute",
      "description": "<p>You conjure a ghostly hand which you control as an extension of your reach. A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.</p><p>You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.</p><p>The hand can't attack, activate magic items, or carry more than 10 pounds.</p>"
    },
    {
      "id": "magic_missile",
      "name": "Magic Missile",
      "tier": "1st",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>Glowing motes of force unerringly streak toward your target. You create three darts that each hit a creature of your choice you can see within range. You can choose whether the darts hit the same creature, or different creatures. Each dart deals 1d4 + 1 force damage to its target.</p><p><em>At Higher Tiers.</em> You create one more dart for each additional tier.</p>"
    },
    {
      "id": "magic_weapon",
      "name": "Magic Weapon",
      "tier": "2nd",
      "source": "Arcane and Wyrd",
      "school": "Transmutation",
      "castingTime": "1 bonus action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You enchant a weapon with magical might, improving its use in combat. You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls.</p><p><em>At Higher Tiers.</em> The bonus increases to +2 at 4th tier, and +3 at 6th tier.</p>"
    },
    {
      "id": "major_image",
      "name": "Major Image",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You conjure a convincing, intricate illusion that functions at your mental command. You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can't create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte's stench).</p><p>As long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.</p><p>Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful INT (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.</p><p><em>At Higher Tiers.</em> Starting at 6th tier, the spells lasts until dispelled without requiring concentration.</p>"
    },
    {
      "id": "mass_cure_wounds",
      "name": "Mass Cure Wounds",
      "tier": "5th",
      "source": "Divine and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>Choose up to six creatures in a 30-foot-radius sphere centered on a point of your choice within range. Each target regains hit points equal to 4d8 + your spellcasting ability modifier. This spell has no effect on Undead or Constructs.</p><p><em>At Higher Tiers.</em> Add +2d8 healing for each additional tier.</p>"
    },
    {
      "id": "mass_faerie_fire",
      "name": "Mass Faerie Fire",
      "tier": "4th",
      "source": "Wyrd",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You can place up to three 20-foot cubes each centered on a point you can see within range. Each object in a cube is outlined in blue, green, or violet light (your choice). Any creature in a cube when the spell is cast is also outlined in light if it fails a DEX save. A creature in the area of more than one cube is affected only once. For the duration, each affected object and creature sheds dim light in a 10-foot radius for the duration.</p><p>Any attack roll against an affected creature or object has advantage if the attacker can see it, and the affected creature or object can't benefit from being invisible.</p>"
    },
    {
      "id": "mass_heal",
      "name": "Mass Heal",
      "tier": "9th",
      "source": "Divine and Primordial",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You restore up to 700 HP, divided as you choose among any number of creatures that you can see within range. Creatures healed by this spell are also cured of all diseases and any effect making them blinded or deafened. This spell has no effect on Constructs or Undead.</p>"
    },
    {
      "id": "mass_healing_word",
      "name": "Mass Healing Word",
      "tier": "3rd",
      "source": "Divine",
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "60 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You utter a compassionate word of power that swiftly heals the nearby wounded. Up to six creatures of your choice that you can see within range regain hit points equal to 2d4 + your spellcasting ability modifier. This spell has no effect on Undead or Constructs.</p><p><em>At Higher Tiers.</em> Add +2d4 healing for each additional tier.</p>"
    },
    {
      "id": "mass_suggestion",
      "name": "Mass Suggestion",
      "tier": "6th",
      "source": "Arcane and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": "24 hours",
      "description": "<p>You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, or do some other obviously harmful act automatically negates the effect of the spell.</p><p>Each target must make a WIS save. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.</p><p>You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a group of soldiers give all their money to the first beggar they meet. If the condition isn't met before the spell ends, the activity isn't performed.</p><p>If you or any of your companions damage a creature affected by this spell, the spell ends for that creature.</p><p><em>At Higher Tiers.</em> The duration is 10 days at 7th tier, 30 days at 8th tier, and a year at 9th tier.</p>"
    },
    {
      "id": "maze",
      "name": "Maze",
      "tier": "8th",
      "source": "Arcane and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You banish a creature that you can see within range into a labyrinthine demiplane. The target remains there for the duration or until it escapes the maze. The target can use its action to attempt to escape. When it does so, it makes a DC 20 INT check. If it succeeds, it escapes, and the spell ends.</p><p>When the spell ends, the target reappears in the space it left or, if that space is occupied, in the nearest unoccupied space.</p>"
    },
    {
      "id": "meld_into_stone",
      "name": "Meld Into Stone",
      "tier": "3rd",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>You fuse yourself into a nearby stone surface for an extended duration. Using your movement, you step into a stone object or surface large enough to fully contain your body and gear. Nothing of your presence remains visible or otherwise detectable by nonmagical senses.</p><p>While merged with the stone, you can't see what occurs outside it, and any WIS (Perception) checks you make to hear sounds outside it are made with disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use your movement to leave the stone where you entered it, which ends the spell. Otherwise, you can't move.</p><p>Minor physical damage to the stone doesn't harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals 6d6 bludgeoning damage to you. The stone's complete destruction (or transmutation into a different substance) expels you and deals 50 bludgeoning damage to you. If expelled, you fall prone in an unoccupied space closest to where you first entered.</p>"
    },
    {
      "id": "mending",
      "name": "Mending",
      "tier": "Cantrip",
      "source": "Arcane and Divine",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": null,
      "description": "<p>In a moment of deep intent, something broken becomes whole again. You repair a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage.</p><p>This spell can physically repair a magic item or Construct, but the spell can't restore magic to such an object.</p>"
    },
    {
      "id": "message",
      "name": "Message",
      "tier": "Cantrip",
      "source": "Arcane and Wyrd",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "1 round",
      "description": "<p>You open a clandestine, two-way communication with your target, known only to you two. You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear.</p><p>You can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier.</p><p>Magical silence, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood blocks the spell. The spell doesn't have to follow a straight line and can travel freely around corners or through openings.</p>"
    },
    {
      "id": "meteor_swarm",
      "name": "Meteor Swarm",
      "tier": "9th",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "1 mile (40-foot-radius sphere)",
      "components": "V, S",
      "duration": null,
      "description": "<p>Blazing orbs of fire plummet to the ground at four different points you can see within range. Each creature in a 40-foot-radius sphere centered on each point you choose must make a DEX save. The sphere spreads around corners. A creature takes 20d6 fire damage and 20d6 bludgeoning damage on a failed save, or half as much damage on a successful one. A creature in the area of more than one fiery burst is affected only once.</p><p>The spell damages objects in the area and ignites flammable objects that aren't being worn or carried.</p>"
    },
    {
      "id": "mind_blank",
      "name": "Mind Blank",
      "tier": "8th",
      "source": "Arcane",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "24 hours",
      "description": "<p>Until the spell ends, one willing creature you touch is immune to psychic damage, any effect that would sense its emotions or read its thoughts, divination spells, and the charmed condition. The spell even foils wish spells and spells or effects of similar power used to affect the target's mind or to gain information about the target.</p>"
    },
    {
      "id": "minor_illusion",
      "name": "Minor Illusion",
      "tier": "Cantrip",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "S",
      "duration": "1 minute",
      "description": "<p>A gesture manifests an illusion of a sound or image of your design. The illusion lasts for the duration and ends if you dismiss it as an action or cast this spell again.</p><p>If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else's voice, a lion's roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.</p><p>If you create an image of an objectsuch as a chair, muddy footprints, or a small chestit must be no larger than a 5-foot cube. The image can't create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.</p><p>If a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful INT (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.</p>"
    },
    {
      "id": "mirror_image",
      "name": "Mirror Image",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "1 minute",
      "description": "<p>You conjure three images of yourself that constantly shift to obscure your true position. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it's impossible to track which image is real. You can use your action to dismiss the illusory duplicates.</p><p>Each time a creature targets you with an attack during the spell's duration, roll a d20 to determine whether the attack instead targets one of your duplicates. If you have three duplicates, you must roll a 6 or higher to change the attack's target to a duplicate. With two duplicates, you must roll an 8 or higher. With one duplicate, you must roll an 11 or higher.</p><p>A duplicate's AC equals 10 + your DEX modifier. If an attack hits a duplicate, the duplicate is destroyed. A duplicate can be destroyed only by an attack that targets it. A duplicate ignores all other damage and effects. The spell ends when all three duplicates are destroyed.</p><p>A creature is unaffected by this spell if it can't see, if it relies on senses other than sight, such as keensense, or if it can perceive illusions as false, as with truesight.</p>"
    },
    {
      "id": "mislead",
      "name": "Mislead",
      "tier": "5th",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "Self",
      "components": "S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You become invisible at the same time that an illusory double of you appears where you are standing. The double lasts for the duration, but the invisibility ends if you attack or cast a spell.</p><p>You can use your action to move your illusory double up to twice your speed and make it gesture, speak, and behave in whatever way you choose.</p><p>You can see through its eyes and hear through its ears as if you were located where it is. On each of your turns as a bonus action, you can switch from using its senses to using your own, or back again. While you are using its senses, you are blinded and deafened in regard to your own surroundings.</p>"
    },
    {
      "id": "misty_step",
      "name": "Misty Step",
      "tier": "2nd",
      "source": "Arcane, Primordial, and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": null,
      "description": "<p>With a quick arcane phrase, you teleport a short way away. Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.</p>"
    },
    {
      "id": "modify_memory",
      "name": "Modify Memory",
      "tier": "5th",
      "source": "Arcane",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>One creature that you can see must make a WIS save. If you are fighting the creature, it has advantage on the save. On a failed save, the target becomes charmed by you for the duration. The charmed target is incapacitated and unaware of its surroundings, though it can still hear you. If it takes any damage or is targeted by another spell, this spell ends, and none of the target's memories are modified.</p><p>While this charm lasts, you can affect the target's memory of an event that it experienced within the last 24 hours and that lasted no more than 10 minutes. You can permanently eliminate all memory of the event, allow the target to recall the event with perfect clarity and exacting detail, change its memory of the details of the event, or create a memory of some other event.</p><p>You must speak to the target to describe how its memories are affected, and it must be able to understand your language for the modified memories to take root. Its mind fills in any gaps in the details of your description. If the spell ends before you have finished describing the modified memories, the creature's memory isn't altered.</p><p>Otherwise, the modified memories take hold when the spell ends.</p><p>A modified memory doesn't necessarily affect how a creature behaves, particularly if the memory contradicts the creature's natural inclinations or beliefs. An illogical modified memory, such as implanting a memory of how much the creature enjoyed dousing itself in acid, is dismissed, perhaps as a bad dream. The GM might deem a modified memory too nonsensical to affect a creature in a significant manner.</p><p>A remove curse or greater restoration spell cast on the target restores the creature's true memory.</p><p><em>At Higher Tiers.</em> At higher tiers, you can alter the target's memories of an event that took place up to 7 days ago (6th tier), 30 days ago (7th tier), 1 year ago (8th tier), or any time in the creature's past (9th tier).</p>"
    },
    {
      "id": "moonbeam",
      "name": "Moonbeam",
      "tier": "2nd",
      "source": "Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>A continuous beam of moonlight shines on your target, searing them with astral radiance. The dim silvery light shines down in a 5-foot-radius, 40-foot-high cylinder centered on a point within range. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a CON save. It takes 2d10 radiant damage on a failed save, or half as much damage on a successful one.</p><p>A creature with the Shapechanger tag makes this save with disadvantage. If it fails, it also instantly reverts to its original form and can't assume a different form until it leaves the spell's light.</p><p>On each of your turns after you cast this spell, you can use an action to move the beam 60 feet in any direction.</p><p><em>At Higher Tiers.</em> Add 1d10 damage for each additional tier.</p>"
    },
    {
      "id": "move_earth",
      "name": "Move Earth",
      "tier": "6th",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 2 hours",
      "description": "<p>Choose an area of terrain no larger than 40 feet on a side within range. You can reshape dirt, sand, or clay in the area in any manner you choose for the duration. You can raise or lower the area's elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can't exceed half the area's largest dimension. So, if you affect a 40-foot square, you can create a pillar up to 20 feet high, raise or lower the square's elevation by up to 20 feet, dig a trench up to 20 feet deep, and so on. It takes 10 minutes for these changes to complete.</p><p>At the end of every 10 minutes you spend concentrating on the spell, you can choose a new area of terrain to affect. Because the terrain's transformation occurs slowly, creatures in the area can't usually be trapped or injured by the ground's movement. This spell can't manipulate natural stone or stone construction. Rocks and structures shift to accommodate the new terrain. If the way you shape the terrain would make a structure unstable, it might collapse.</p><p>Similarly, this spell doesn't directly affect plant growth. The moved earth carries any plants along with it.</p>"
    },
    {
      "id": "nondetection",
      "name": "Nondetection",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (a pinch of diamond dust worth 25 gp sprinkled over the target, which the spell consumes)",
      "duration": "8 hours",
      "description": "<p>You hide a target that you touch from divination magic. The target can be a willing creature or a place or an object no larger than 10 feet in any dimension. The target can't be targeted by any divination magic or perceived through magical scrying sensors.</p>"
    },
    {
      "id": "pass_without_trace",
      "name": "Pass Without Trace",
      "tier": "2nd",
      "source": "Primordial",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>A veil of shadows and silence radiates from you, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to DEX (Stealth) checks and can't be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage.</p>"
    },
    {
      "id": "passwall",
      "name": "Passwall",
      "tier": "5th",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>A passage appears at a point of your choice that you can see on a wooden, plaster, or stone surface (such as a wall, a ceiling, or a floor) within range, and lasts for the duration.</p><p>You choose the opening's dimensions: up to 5 feet wide, 8 feet tall, and 20 feet deep. The passage creates no instability in a structure surrounding it.</p><p>When the opening disappears, any creatures or objects still in the passage created by the spell are safely ejected to an unoccupied space nearest to the surface on which you cast the spell.</p>"
    },
    {
      "id": "phantasmal_killer",
      "name": "Phantasmal Killer",
      "tier": "4th",
      "source": "Arcane and Wyrd",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You tap into the nightmares of a creature you can see within range and create an illusory manifestation of its deepest fears, visible only to that creature. The target must make a WIS save. On a failed save, the target becomes frightened of you for the duration. At the end of each of the target's turns before the spell ends, the target must succeed on a WIS save or take 4d10 psychic damage. On a successful save, the spell ends.</p><p><em>At Higher Tiers.</em> Add 1d10 damage for each additional tier.</p>"
    },
    {
      "id": "plane_shift",
      "name": "Plane Shift",
      "tier": "7th",
      "source": "Divine and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (a tuning fork worth 250 gp, attuned to a particular plane of existence)",
      "duration": null,
      "description": "<p>You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the city of Fandeval in the Shadow Realm, and you appear in or near that destination. If you are trying to reach Fandeval, for example, you might arrive in the Old Market Square district at the heart of the city, on the road that leads to the Sleeper's Gate entrance, or looking at the city from across the River Styx, at the GM's discretion.</p><p>Alternatively, if you know the sigil sequence of a teleportation circle on another plane of existence, this spell can take you to that circle. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle.</p><p>You can use this spell to banish an unwilling creature to another plane. Choose a creature within your reach and make a melee spell attack against it. On a hit, the creature must make a CHA save. On a failure, the creature is transported to a random location on the plane of existence you specify. A creature so transported must find its own way back to your current plane of existence.</p>"
    },
    {
      "id": "plant_growth",
      "name": "Plant Growth",
      "tier": "3rd",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action or 8 hours",
      "range": "150 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You either cause normal plants to grow wildly and slow movement or make crops double their yield. There are two possible uses for this spell, depending on its casting time, granting either immediate or long-term benefits.</p><p>If you cast this spell using 1 action, choose a point within range. All normal plants in a 100-foot radius centered on that point become thick and overgrown. A creature moving through the area must spend 4 feet of movement for every 1 foot it moves. You can exclude one or more areas of any size within the spell's area from being affected.</p><p>If you cast this spell over 8 hours, you enrich the land. All plants in a half-mile radius centered on a point within range become enriched for 1 year. The plants yield twice the normal amount of food when harvested.</p>"
    },
    {
      "id": "poison_spray",
      "name": "Poison Spray",
      "tier": "Cantrip",
      "source": "Arcane and Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "10 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You fling a spume of poison at a nearby target. The creature must succeed on a CON save or take 1d12 poison damage.</p><p>This spell's damage increases by 1d12 when you reach 5th level (2d12), 11th level (3d12), and 17th level (4d12).</p>"
    },
    {
      "id": "polymorph",
      "name": "Polymorph",
      "tier": "4th",
      "source": "Primordial and Wyrd",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You turn a creature into a Beast of your choice. This spell transforms a creature that you can see within range into a new form. The new form can be any Beast whose challenge rating is equal to or less than the target's challenge rating or spell tier. The target's game statistics, including INT, WIS, and CHA, are replaced by those of the chosen Beast. It does retain its personality, though.</p><p>An unwilling creature must make a WIS save to avoid the effect. The spell has no effect on a Shapechanger or a creature with 0 hit points. The transformation lasts for the duration, until the target drops to 0 hit points, or until it dies.</p><p>The target has the maximum hit points of its new form. When it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious.</p><p>The creature is limited by the nature of its new form. It can't speak, cast spells, or take any action that requires hands or speech. The target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment.</p>"
    },
    {
      "id": "power_word_kill",
      "name": "Power Word Kill",
      "tier": "9th",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You utter a word of power that can compel one creature you can see within range to die instantly. If the creature you choose has 100 HP or fewer, it dies. Otherwise, the spell has no effect.</p>"
    },
    {
      "id": "power_word_recover",
      "name": "Power Word Recover",
      "tier": "9th",
      "source": "Divine",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You utter a word of power that completely heals one creature you can see within range. The creature is restored to maximum hit points. In addition, any charmed, frightened, paralyzed, or stunned conditions affecting the target immediately end. This spell has no effect on Constructs or Undead.</p>"
    },
    {
      "id": "power_word_stun",
      "name": "Power Word Stun",
      "tier": "8th",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": null,
      "description": "<p>You speak a word of power that can overwhelm the mind of one creature you can see within range, leaving it dazed. If the target has 150 HP or fewer, it is stunned. Otherwise, the spell has no effect. The stunned target must make a CON save at the end of each of its turns, ending the effect on itself on a success.</p>"
    },
    {
      "id": "prayer_of_healing",
      "name": "Prayer of Healing",
      "tier": "2nd",
      "source": "Divine",
      "school": "Necromancy",
      "castingTime": "10 minutes (ritual)",
      "range": "30 feet",
      "components": "V",
      "duration": null,
      "description": "<p>Up to six creatures you can see within range each regain HP equal to 2d8 + your spellcasting ability modifier. This spell has no effect on Constructs or Undead. You can cast this spell once per long rest.</p><p>At Higher Tiers: Add +2d8 healing for each additional tier.</p>"
    },
    {
      "id": "prestidigitation",
      "name": "Prestidigitation",
      "tier": "Cantrip",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "10 feet",
      "components": "V, S",
      "duration": "Up to 1 hour",
      "description": "<p>You tap rudimentary magic to create a variety of helpful or irksome effects around you. You create one of the following magical effects within range:</p><ul><li>You create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.</li><li>You instantaneously light or snuff out a candle, a torch, or a small campfire.</li><li>You instantaneously clean or soil an object no larger than 1 cubic foot.</li><li>You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.</li><li>You make a color, a small mark, or a symbol appear on an object or a surface for 1 hour.</li><li>You create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn.</li></ul><p>If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.</p>"
    },
    {
      "id": "prismatic_spray",
      "name": "Prismatic Spray",
      "tier": "7th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (60-foot cone)",
      "components": "V, S",
      "duration": null,
      "description": "<p>Eight multicolored rays of light flash from your hand. Each ray is a different color and has a different power and purpose. Each creature in a 60-foot cone must make a DEX save. For each target, roll a d8 to determine which color ray affects it.</p><ul><li>Red. The target takes 10d6 fire damage on a failed save, or half as much damage on a successful one.</li><li>Orange. The target takes 10d6 acid damage on a failed save, or half as much damage on a successful one.</li><li>Yellow. The target takes 10d6 lightning damage on a failed save, or half as much damage on a successful one.</li><li>Green. The target takes 10d6 poison damage on a failed save, or half as much damage on a successful one.</li><li>Blue. The target takes 10d6 cold damage on a failed save, or half as much damage on a successful one.</li><li>Indigo. On a failed save, the target is restrained. It must then make a CON save at the end of each of its turns. If it successfully saves three times, the spell ends. If it fails its save three times, it permanently turns to stone and is subjected to the petrified condition. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.</li><li>Violet. On a failed save, the target is blinded. It must then make a WIS save at the start of your next turn. A successful save ends the blindness. If it fails that save, the creature is transported to another plane of existence of the GM's choosing and is no longer blinded. Typically, a creature that is on a plane that isn't its home plane is banished home, while other creatures are usually cast into the Astral or Ethereal planes.</li></ul><p>Special. The target is struck by two rays. Roll twice more, rerolling any 8.</p>"
    },
    {
      "id": "prismatic_wall",
      "name": "Prismatic Wall",
      "tier": "9th",
      "source": "Arcane",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "10 minutes",
      "description": "<p>A shimmering, multicolored plane of light forms a vertical, opaque wallup to 90 feet long, 30 feet high, and 1 inch thickcentered on a point you can see within range.</p><p>Alternatively, you can shape the wall into a sphere up to 30 feet in diameter centered on a point you choose within range. The wall remains in place for the duration. If you position the wall so that it passes through a space occupied by a creature, the spell fails, and your action and the spell slot are wasted.</p><p>The wall sheds bright light to a range of 100 feet and dim light for an additional 100 feet. You and creatures you designate at the time you cast the spell can pass through and remain near the wall without harm. If another creature that can see the wall moves to within 20 feet of it or starts its turn there, the creature must succeed on a CON save or become blinded for 1 minute.</p><p>The wall consists of seven layers, each with a different color. When a creature attempts to reach into or pass through the wall, it does so one layer at a time through all the wall's layers. As it passes or reaches through each layer, the creature must make a DEX save or be affected by that layer's properties as described below.</p><p>The wall can be destroyed, also one layer at a time, in order from red to violet, by means specific to each layer.</p><p>Once a layer is destroyed, it remains so for the duration of the spell. An antimagic field has no effect on the wall.</p><ul><li>Red. The creature takes 10d6 fire damage on a failed save, or half as much damage on a successful one. While this layer is in place, nonmagical ranged attacks can't pass through the wall. The layer can be destroyed by dealing at least 25 cold damage to it.</li><li>Orange. The creature takes 10d6 acid damage on a failed save, or half as much damage on a successful one. While this layer is in place, magical ranged attacks can't pass through the wall. The layer is destroyed by a strong wind.</li><li>Yellow. The creature takes 10d6 lightning damage on a failed save, or half as much damage on a successful one. This layer can be destroyed by dealing at least 60 force damage to it.</li><li>Green. The creature takes 10d6 poison damage on a failed save, or half as much damage on a successful one. A passwall spell, or another spell of equal or greater tier that can open a portal on a solid surface, destroys this layer.</li><li>Blue. The creature takes 10d6 cold damage on a failed save, or half as much damage on a successful one. This layer can be destroyed by dealing at least 25 fire damage to it.</li><li>Indigo. On a failed save, the creature is restrained. It must then make a CON save at the end of each of its turns. If it successfully saves three times, the spell ends. If it fails its save three times, it permanently turns to stone and is subjected to the petrified condition. The successes and failures don't need to be consecutive; keep track of both until the creature collects three of a kind. While this layer is in place, spells can't be cast through the wall. The layer is destroyed by bright light shed by a daylight spell or a similar spell of equal or higher tier.</li><li>Violet. On a failed save, the creature is blinded. It must then make a WIS save at the start of your next turn. A successful save ends the blindness. If it fails that save, the creature is transported to another plane of the GM's choosing and is no longer blinded. Typically, a creature that is on a plane that isn't its home plane is banished home, while other creatures are usually cast into the Astral or Ethereal planes. This layer is destroyed by a dispel magic spell or a similar spell of equal or higher tier that can end spells and magical effects.</li></ul></p>"
    },
    {
      "id": "produce_flame",
      "name": "Produce Flame",
      "tier": "Cantrip",
      "source": "Arcane and Primordial",
      "school": "Conjuration",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V, S",
      "duration": "10 minutes",
      "description": "<p>You conjure a ball of handheld flame, useful as both a light source and a weapon. The flame remains for the duration and harms neither you nor your equipment. It sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again.</p><p>You can also attack with the flame, although doing so ends the spell. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 30 feet of you. Make a ranged spell attack. On a hit, the target takes 1d8 fire damage.</p><p>This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>"
    },
    {
      "id": "programmed_illusion",
      "name": "Programmed Illusion",
      "tier": "6th",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S, M (jade worth 25 gp)",
      "duration": "Until dispelled",
      "description": "<p>You create an illusion of an object, a creature, or some other visible phenomenon within range that activates when a specific condition occurs. The illusion is imperceptible until then. It must be no larger than a 30-foot cube, and you decide when you cast the spell how the illusion behaves and what sounds it makes. This scripted performance can last up to 5 minutes.</p><p>When the condition you specify occurs, the illusion springs into existence and performs in the manner you described. Once the illusion finishes performing, it disappears and remains dormant for 10 minutes. After this time, the illusion can be activated again.</p><p>The triggering condition can be as general or as detailed as you like, though it must be based on visual or audible conditions that occur within 30 feet of the area. For example, you could create an illusion of yourself to appear and warn off others who attempt to open a trapped door, or you could set the illusion to trigger only when a creature says the correct word or phrase.</p><p>Physical interaction with the image reveals it to be an illusion because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful INT (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and any noise it makes sounds hollow to the creature.</p>"
    },
    {
      "id": "project_image",
      "name": "Project Image",
      "tier": "7th",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "500 feet",
      "components": "V, S, M (a small replica of you worth 5 gp)",
      "duration": "Concentration, up to 1 day",
      "description": "<p>You create an illusory copy of yourself that lasts for the duration. The copy can appear at any location within range that you have seen before, regardless of intervening obstacles. The illusion looks and sounds like you but is intangible. If the illusion takes any damage, it disappears, and the spell ends.</p><p>You can use your action to move this illusion up to twice your speed and make it gesture, speak, and behave in whatever way you choose. It mimics your mannerisms perfectly.</p><p>You can see through its eyes and hear through its ears as if you were in its space. On your turn as a bonus action, you can switch from using its senses to using your own, or back again. While you are using its senses, you are blinded and deafened in regard to your own surroundings.</p><p>Physical interaction with the image reveals it to be an illusion because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful INT (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and any noise it makes sounds hollow to the creature.</p>"
    },
    {
      "id": "protection_from_energy",
      "name": "Protection From Energy",
      "tier": "3rd",
      "source": "Arcane, Divine, and Primordial",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You ward your target against harmful elemental energies. For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder.</p>"
    },
    {
      "id": "protection_from_evil_and_good",
      "name": "Protection From Evil and Good",
      "tier": "1st",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (holy water or powdered silver and iron, which the spell consumes)",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You place a ward upon your target that protects against certain types of creatures. The protection grants several benefits against Aberrations, Celestials, Elementals, Fey, Fiends, and Undead. Those creatures have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them. If the target is already charmed, frightened, or possessed by such a creature, the target has advantage on any new save against the relevant effect.</p>"
    },
    {
      "id": "protection_from_poison",
      "name": "Protection From Poison",
      "tier": "2nd",
      "source": "Divine and Primordial",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You neutralize poison in a creature and guard them against further contamination. If more than one poison afflicts the target, you neutralize one poison that you know is present, or you neutralize one at random. For the duration, the target has advantage on saves against being poisoned, and it has resistance to poison damage.</p>"
    },
    {
      "id": "raise_dead",
      "name": "Raise Dead",
      "tier": "5th",
      "source": "Divine",
      "school": "Necromancy",
      "castingTime": "1 hour (ritual)",
      "range": "Touch",
      "components": "V, S, M (500 gp diamond which the spell consumes)",
      "duration": null,
      "description": "<p>You return a creature to life, provided it has been dead no longer than 10 days. If the creature's soul is willing and able to return, the creature returns with 1 HP and 4 levels of exhaustion.</p><p>The spell neutralizes poisons and cures nonmagical diseases present at death but does not remove magical diseases, curses, or similar magical effects. The spell cannot return undead creatures to life and does not restore missing body parts. If vital parts are missing, like the head, the spell fails.</p>"
    },
    {
      "id": "ray_of_enfeeblement",
      "name": "Ray of Enfeeblement",
      "tier": "2nd",
      "source": "Arcane and Wyrd",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>A beam of black power lances from your finger, sapping the vigor of your target. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use STR until the spell ends.</p><p>At the end of each of the target's turns, it can make a CON save against the spell. On a success, the spell ends.</p>"
    },
    {
      "id": "ray_of_frost",
      "name": "Ray of Frost",
      "tier": "Cantrip",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>A chilling ray cascades upon your target, freezing them into lethargy. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn.</p><p>The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>"
    },
    {
      "id": "remove_curse",
      "name": "Remove Curse",
      "tier": "3rd",
      "source": "Divine",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": null,
      "description": "<p>Your touch immediately breaks any curses that bind a target. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's attunement to the object so it can be removed or discarded.</p>"
    },
    {
      "id": "resilient_sphere",
      "name": "Resilient Sphere",
      "tier": "4th",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>A sphere of shimmering force encloses a creature or object of Large size or smaller within range. An unwilling creature must make a DEX save. On a failed save, the creature is enclosed for the duration. Nothingnot physical objects, energy, or other spell effectscan pass through the barrier, in or out, though a creature in the sphere can breathe there. The sphere is immune to all damage, and a creature or object inside can't be damaged by attacks or effects originating from outside, nor can a creature inside the sphere damage anything outside it.</p><p>The sphere is weightless and just large enough to contain the creature or object inside. An enclosed creature can use its action to push against the sphere's walls and thus roll the sphere at up to half the creature's speed. Similarly, the globe can be picked up and moved by other creatures.</p><p>A disintegrate spell targeting the globe destroys it without harming anything inside it.</p>"
    },
    {
      "id": "resistance",
      "name": "Resistance",
      "tier": "Cantrip",
      "source": "Divine and Primordial",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You grant the target increased capacity to withstand harmful effects. You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one save of its choice. It can roll the die before or after making the save. The spell then ends.</p>"
    },
    {
      "id": "restoration",
      "name": "Restoration",
      "tier": "2nd",
      "source": "Divine and Primordial",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": null,
      "description": "<p>You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned.</p>"
    },
    {
      "id": "reverse_gravity",
      "name": "Reverse Gravity",
      "tier": "7th",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "100 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>This spell reverses gravity in a 50-foot-radius, 100-foot-high cylinder centered on a point within range. All creatures and objects that aren't somehow anchored to the ground in the area fall upward and reach the top of the area when you cast this spell. A creature can make a DEX save to grab onto a fixed object it can reach, thus avoiding the fall.</p><p>If some solid object (such as a ceiling) is encountered in this fall, falling objects and creatures strike it just as they would during a normal downward fall. If an object or creature reaches the top of the area without striking anything, it remains there, oscillating slightly, for the duration.</p><p>At the end of the duration, affected objects and creatures fall back down.</p>"
    },
    {
      "id": "revivify",
      "name": "Revivify",
      "tier": "3rd",
      "source": "Divine",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (diamonds worth 300 gp, which the spell consumes)",
      "duration": null,
      "description": "<p>You restore a recently slain creature from death to life. You touch a creature that has died within the last minute. It returns to life with 1 hit point. This spell can't return to life a creature that has died of old age, nor can it restore missing body parts.</p>"
    },
    {
      "id": "rope_trick",
      "name": "Rope Trick",
      "tier": "2nd",
      "source": "Arcane and Wyrd",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You enchant a rope to transfix itself in the air. Climbing it leads to an extradimensional hideout. You touch a length of rope that is up to 60 feet long. One end of the rope then rises into the air until the whole rope hangs perpendicular to the ground. At the upper end of the rope, an invisible entrance opens to an extradimensional space that lasts until the spell ends.</p><p>The space can hold as many as eight Medium or smaller creatures. The rope can be pulled into the space, making the rope disappear from view outside the space.</p><p>Attacks and spells can't cross through the entrance into or out of the extradimensional space, but those inside can see out of it as if through a 3-foot-by-5-foot window centered on the rope.</p><p>Anything inside the extradimensional space falls to the ground when the spell ends.</p>"
    },
    {
      "id": "sacred_flame",
      "name": "Sacred Flame",
      "tier": "Cantrip",
      "source": "Divine",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You bathe one target in a searing, flame-like radiance. The target must succeed on a DEX save or take 1d8 radiant damage. The target gains no benefit from cover for this save.</p><p>The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>"
    },
    {
      "id": "sanctuary",
      "name": "Sanctuary",
      "tier": "1st",
      "source": "Divine",
      "school": "Abjuration",
      "castingTime": "1 bonus action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "1 minute",
      "description": "<p>Your prayers offer a refuge for yourself or another. You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a WIS save. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball.</p><p>If the warded creature makes an attack or casts a spell that affects an enemy creature, this spell ends.</p>"
    },
    {
      "id": "scorching_ray",
      "name": "Scorching Ray",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>A series of superheated rays lance toward your chosen targets. You create three rays of fire and hurl them at targets within range. You can hurl them at one target or several. Make a ranged spell attack for each ray. On a hit, the target takes 2d6 fire damage.</p><p>At Higher Tiers. You create one additional ray for each additional tier.</p>"
    },
    {
      "id": "see_invisibility",
      "name": "See Invisibility",
      "tier": "2nd",
      "source": "Arcane and Wyrd",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You temporarily gain the ability to see invisible and ethereal things. For the duration, you see invisible creatures and objects as if they were visible, and you can see into the Ethereal Plane. Ethereal creatures and objects appear ghostly and translucent.</p>"
    },
    {
      "id": "seeming",
      "name": "Seeming",
      "tier": "5th",
      "source": "Arcane and Wyrd",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>This spell allows you to change the appearance of any number of creatures that you can see within range. You give each target you choose a new, illusory appearance. An unwilling target can make a CHA save, and if it succeeds, it is unaffected by this spell.</p><p>The spell disguises physical appearance as well as clothing, armor, weapons, and equipment. You can make each creature seem 1 foot shorter or taller and appear thin, fat, or in between. You can't change a target's body type, so you must choose a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The spell lasts for the duration, unless you use your action to dismiss it sooner.</p><p>The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to a creature's outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel the creature's head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.</p><p>A creature can use its action to inspect a target and make an INT (Investigation) check against your spell save DC. If it succeeds, it becomes aware that the target is disguised.</p>"
    },
    {
      "id": "sending",
      "name": "Sending",
      "tier": "3rd",
      "source": "Arcane and Divine",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Unlimited",
      "components": "V, S",
      "duration": "1 round",
      "description": "<p>You broadcast a mental message that anyone can understand and respond to. You send a short message of twenty-five words or less to a creature with whom you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with an INT modifier of at least 5 to understand the meaning of your message.</p><p>You can send the message across any distance and even to other planes of existence, but if the target is on a different plane than you, there is a 5 percent chance that the message doesn't arrive.</p>"
    },
    {
      "id": "sequester",
      "name": "Sequester",
      "tier": "7th",
      "source": "Arcane and Divine",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (gemstone dust worth 5000 gp, which the spell consumes)",
      "duration": "Until dispelled",
      "description": "<p>By means of this spell, a willing creature or an object can be hidden away, safe from detection for the duration. When you cast the spell and touch the target, it becomes invisible and can't be targeted by divination spells or perceived through scrying sensors created by divination spells.</p><p>If the target is a creature, it falls into a state of suspended animation. Time ceases to flow for it, and it doesn't grow older.</p><p>You can set a condition for the spell to end early. The condition can be anything you choose, but it must occur or be visible within 1 mile of the target. Examples include after 1,000 years or when the tarrasque awakens. This spell also ends if the target takes any damage.</p>"
    },
    {
      "id": "shapechange",
      "name": "Shapechange",
      "tier": "9th",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M (a jade circlet worth 1,500 gp, which you wear as you cast the spell)",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You assume the form of a different creature for the duration. The new form can be of any creature with a challenge rating equal to your level or lower. The creature can't be a Construct or an Undead, and you must have seen the sort of creature at least once.</p><p>You transform into an average example of that creature, one without any class levels or the Spellcasting trait.</p><p>Your game statistics are replaced by the statistics of the chosen creature, though you retain your INT, WIS, and CHA scores. You also retain all of your skill and save proficiencies. When you make an ability check or save, you can choose to use your modifiers or the creature's (whichever is higher). You can't use any legendary actions or lair actions of the new form.</p><p>You assume the hit points and hit dice of the new form. When you revert to your normal form, you return to the number of hit points you had before you transformed. If you revert as a result of dropping to 0 HP, any excess damage carries over to your normal form. As long as the excess damage doesn't reduce your normal form to 0 HP, you aren't knocked unconscious.</p><p>You retain the benefit of any features from your class, lineage, or other source and can use them, provided that your new form is physically capable of doing so. You can't use any special senses you have (for example, darkvision) unless your new form also has that sense. You can only speak if the creature can normally speak.</p><p>When you transform, you choose whether your equipment falls to the ground, merges into the new form, or is worn by it. Worn equipment functions as normal. The GM determines whether it is practical for the new form to wear a piece of equipment based on the creature's shape and size. Your equipment doesn't change shape or size to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge into your new form. Equipment that merges has no effect in that state.</p><p>During this spell's duration, you can use your action to assume a different form following the same restrictions and rules for the original form, with one exception: if your new form has more hit points than your current one, your hit points remain at their current value.</p>"
    },
    {
      "id": "shatter",
      "name": "Shatter",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>A point you can see bursts with a painful cacophony of sound. Each creature in a 10-foot-radius sphere centered on a point you choose must make a CON save. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone, crystal, or metal has disadvantage on this save. A nonmagical object that isn't being worn or carried also takes the damage if it's in the spell's area.</p><p>At Higher Tiers. Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "shield",
      "name": "Shield",
      "tier": "1st",
      "source": "Arcane",
      "school": "Abjuration",
      "castingTime": "1 reaction, which you take when you are hit by an attack or targeted by the magic missile spell",
      "range": "Self",
      "components": "V, S",
      "duration": "1 round",
      "description": "<p>You create a ward at the last moment, protecting yourself from all but the stoutest of strikes. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.</p>"
    },
    {
      "id": "shield_of_faith",
      "name": "Shield of Faith",
      "tier": "1st",
      "source": "Divine",
      "school": "Abjuration",
      "castingTime": "1 bonus action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>An shimmering field springs up around your target, protecting them from physical harm. The target gains +2 bonus to AC for the duration.</p>"
    },
    {
      "id": "shillelagh",
      "name": "Shillelagh",
      "tier": "Cantrip",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 bonus action",
      "range": "Touch",
      "components": "V, S, M (a club or quarterstaff)",
      "duration": "1 minute",
      "description": "<p>You briefly imbue a wooden melee weapon with primordial power. The wood of a club or quarterstaff you are holding is imbued with nature's power. For the duration, you can use your spellcasting ability instead of STR for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage die becomes a d8. The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon.</p>"
    },
    {
      "id": "shocking_grasp",
      "name": "Shocking Grasp",
      "tier": "Cantrip",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": null,
      "description": "<p>Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it can't take reactions until the start of its next turn.</p><p>The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>"
    },
    {
      "id": "silence",
      "name": "Silence",
      "tier": "2nd",
      "source": "Divine and Wyrd",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You manifest a globe of silence in an area you choose. For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there.</p>"
    },
    {
      "id": "silent_image",
      "name": "Silent Image",
      "tier": "1st",
      "source": "Arcane",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You create and control a convincing visual illusion. You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 15-foot cube. The image appears at a spot within range and lasts for the duration. The image is purely visual; it isn't accompanied by sound, smell, or other sensory effects.</p><p>You can use your action to cause the image to move to any spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking.</p><p>Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful INT (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image.</p>"
    },
    {
      "id": "sleep",
      "name": "Sleep",
      "tier": "1st",
      "source": "Arcane and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "1 minute",
      "description": "<p>You charm the most susceptible targets nearby into a sudden state of sleeping unconsciousness. Roll 5d8; the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).</p><p>Starting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected.</p><p>Undead and creatures immune to being charmed aren't affected by this spell.</p><p>At Higher Tiers. Roll another 2d8 for each additional tier.</p>"
    },
    {
      "id": "sleet_storm",
      "name": "Sleet Storm",
      "tier": "3rd",
      "source": "Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Cold rain and sleet douse flame, create difficult terrain, and force a save to stand or concentrate. Until the spell ends, freezing rain and sleet fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused.</p><p>The ground in the area is covered with slick ice, making it difficult terrain. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a DEX save. On a failed save, it falls prone.</p><p>If a creature is concentrating in the spell's area, the creature must make a successful CON save against your spell save DC or lose concentration.</p>"
    },
    {
      "id": "slow",
      "name": "Slow",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You magically lengthen time around your targets, reducing their reaction time. You alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a WIS save or be affected by this spell for the duration. An affected target's speed is halved, it takes a 2 penalty to AC and DEX saves, and it can't use reactions. On its turn, it can use either an action or a bonus action, not both.</p><p>Regardless of the creature's abilities or magic items, it can't make more than one melee or ranged attack during its turn.</p><p>If the creature attempts to cast a spell with a casting time of 1 action, roll a d20. On an 11 or higher, the spell doesn't take effect until the creature's next turn, and the creature must use its action on that turn to complete the spell. If it can't, the spell is wasted.</p><p>A creature affected by this spell makes another WIS save at the end of its turn. On a successful save, the effect ends for it.</p>"
    },
    {
      "id": "spare_the_dying",
      "name": "Spare the Dying",
      "tier": "Cantrip",
      "source": "Divine",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "10 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You rescue a dying creature from their impending death. You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on Undead or Constructs.</p>"
    },
    {
      "id": "speak_with_animals",
      "name": "Speak with Animals",
      "tier": "1st",
      "source": "Primordial",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "10 minutes",
      "description": "<p>You gain the ability to understand and verbally communicate with Beasts and creatures with the Animal tag for the duration. The knowledge and awareness of such creatures are limited by their INT, but at minimum, targets can give you information about nearby locations and monsters, including whatever they can perceive or have perceived within the past day. You might be able to persuade a target to perform a small favor for you, at the GM's discretion.</p>"
    },
    {
      "id": "speak_with_dead",
      "name": "Speak with Dead",
      "tier": "3rd",
      "source": "Divine",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "10 feet",
      "components": "V, S",
      "duration": "10 minutes",
      "description": "<p>You bring a spirit back into its cadaverous body for a dialogue of five questions and five answers. The corpse must still have a mouth and can't be Undead. The spell fails if the corpse was the target of this spell within the last 10 days.</p><p>Until the spell ends, you can ask the corpse up to five questions. The corpse knows only what it knew in life, including the languages it knew. Answers are usually brief, cryptic, or repetitive, and the corpse is under no compulsion to offer a truthful answer if you are hostile to it or it recognizes you as an enemy. This spell doesn't return the creature's soul to its body, only its animating spirit. Thus, the corpse can't learn new information, doesn't comprehend anything that has happened since it died, and can't speculate about future events.</p>"
    },
    {
      "id": "speak_with_plants",
      "name": "Speak with Plants",
      "tier": "3rd",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self (30-foot-radius)",
      "components": "V, S",
      "duration": "10 minutes",
      "description": "<p>You awaken a crude intelligence in nearby plants that allows you to speak with and command them. You can question plants about events in the spell's area within the past day, gaining information about creatures that have passed, weather, and other circumstances.</p><p>You can also turn difficult terrain caused by plant growth (such as thickets and undergrowth) into ordinary terrain that lasts for the duration. Or you can turn ordinary terrain where plants are present into difficult terrain that lasts for the duration, causing vines and branches to hinder pursuers, for example.</p><p>Plants might be able to perform other tasks on your behalf, at the GM's discretion. The spell doesn't enable plants to uproot themselves and move about, but they can freely move branches, tendrils, and stalks.</p><p>If a plant creature is in the area, you can communicate with it as if you shared a common language, but you gain no magical ability to influence it.</p><p>This spell can cause the plants created by the entangle spell to release a restrained creature.</p>"
    },
    {
      "id": "spider_climb",
      "name": "Spider Climb",
      "tier": "2nd",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You grant the ability to walk up walls, ceilings, and vertical objects. The target gains a climbing speed equal to its walking speed while leaving its hands free.</p>"
    },
    {
      "id": "spike_growth",
      "name": "Spike Growth",
      "tier": "2nd",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "150 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>A patch of ground sprouts piercing thorns and difficult terrain that looks harmless. The ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns. The area becomes difficult terrain for the duration. When a creature moves into or within the area, it takes 2d4 piercing damage for every 5 feet it travels.</p><p>The transformation of the ground is camouflaged to look natural. Any creature that can't see the area at the time the spell is cast must make a WIS (Perception) check against your spell save DC to recognize the terrain as hazardous before entering it.</p>"
    },
    {
      "id": "spirit_guardians",
      "name": "Spirit Guardians",
      "tier": "3rd",
      "source": "Divine",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "Self (15-foot radius)",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You summon spirits to swarm around and guard you, while harrying nearby foes. When you cast this spell, you can designate any number of creatures you can see to be unaffected by it. An affected creature's speed is halved in the area, and when the creature enters the area for the first time on a turn or starts its turn there, it must make a WIS save. On a failed save, the creature takes 3d8 radiant damage or 3d8 necrotic damage. On a successful save, the creature takes half as much damage.</p><p>At Higher Tiers. Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "spiritual_weapon",
      "name": "Spiritual Weapon",
      "tier": "2nd",
      "source": "Divine",
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "60 feet",
      "components": "V, S",
      "duration": null,
      "description": "<p>You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier.</p><p>As a bonus action on your turn, you can move the weapon up to 20 feet and repeat the attack against a creature within 5 feet of it.</p><p>The weapon can take whatever form you choose. Clerics of deities who are associated with a particular weapon (like Thor and his hammer) make this spell's effect resemble that weapon.</p><p>At Higher Tiers. Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "stinking_cloud",
      "name": "Stinking Cloud",
      "tier": "3rd",
      "source": "Arcane and Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You create a heavy cloud that sickens whomever is caught within it. You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration.</p><p>Each creature that is completely within the cloud at the start of its turn must make a CON save against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don't need to breathe or are immune to poison automatically succeed on this save.</p><p>A moderate wind (at least 10 miles per hour) disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round.</p>"
    },
    {
      "id": "stone_shape",
      "name": "Stone Shape",
      "tier": "4th",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": null,
      "description": "<p>You mold hard stone like soft clay into a new design or structure. You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose. For example, you could shape a large rock into a weapon, idol, or coffer, or make a small passage through a wall, as long as the wall is less than 5 feet thick. You could also shape a stone door or its frame to seal the door shut. The object you create can have up to two hinges and a latch, but finer mechanical detail isn't possible.</p>"
    },
    {
      "id": "stoneskin",
      "name": "Stoneskin",
      "tier": "4th",
      "source": "Arcane and Primordial",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (diamond dust worth 100 gp, which the spell consumes)",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>Your target's skin becomes stony, giving protection from mundane weapons. Until the spell ends, the target has resistance to nonmagical bludgeoning, piercing, and slashing damage.</p>"
    },
    {
      "id": "storm_of_vengeance",
      "name": "Storm of Vengeance",
      "tier": "9th",
      "source": "Divine and Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "Sight",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>A churning storm cloud forms, centered on a point you can see and spreading to a radius of 360 feet. Lightning flashes in the area, thunder booms, and strong winds roar. Each creature under the cloud (no more than 5,000 feet beneath the cloud) when it appears must make a CON save. On a failed save, a creature takes 2d6 thunder damage and becomes deafened for 5 minutes.</p><p>Each round you maintain concentration on this spell, the storm produces additional effects on your turn.</p><p>Round 2. Acidic rain falls from the cloud. Each creature and object under the cloud takes 1d6 acid damage.</p><p>Round 3. You call six bolts of lightning from the cloud to strike six creatures or objects of your choice beneath the cloud. A given creature or object can't be struck by more than one bolt. A struck creature must make a DEX save. The creature takes 10d6 lightning damage on a failed save, or half as much damage on a successful one.</p><p>Round 4. Hailstones rain down from the cloud. Each creature under the cloud takes 2d6 bludgeoning damage.</p><p>Rounds 510. Gusts and freezing rain assail the area under the cloud. The area becomes difficult terrain and is heavily obscured. Each creature there takes 1d6 cold damage. Ranged weapon attacks in the area are impossible. If a creature starts its turn in the storm's area and is concentrating on a spell, the creature must make a successful CON save against your spell save DC or lose concentration. Finally, gusts of strong wind (ranging from 20 to 50 miles per hour) automatically disperse fog, mists, and similar phenomena in the area, whether mundane or magical.</p>"
    },
    {
      "id": "suggestion",
      "name": "Suggestion",
      "tier": "2nd",
      "source": "Arcane and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 8 hours",
      "description": "<p>You lace your honeyed words with an undercurrent of compulsion. You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell.</p><p>The target must make a WIS save. On a failed save, it pursues the course of action you described to the best of its ability. If in combat, the target can repeat the save at the end of each of its turns. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.</p><p>You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn't met before the spell expires, the activity isn't performed.</p><p>If you or any of your companions damage the target, the spell ends.</p>"
    },
    {
      "id": "summon_devil",
      "name": "Summon Devil",
      "tier": "6th",
      "source": "Arcane, Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S, M (600 gp ruby)",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You summon a large, winged devil in an unoccupied space that you can see within range. It takes its turn immediately after yours. It obeys your verbal commands if you give any; otherwise, it takes the Dodge action and moves to avoid danger.</p><p><strong>Devil Stat Block:</strong></p><ul><li>AC: 12 + spell tier</li><li>HP: 40 + 15 for each spell tier above 6th</li><li>Speed: 50ft walk/climb/fly</li><li>Ability Modifiers: Use the spell's tier for attacks and saving throws.</li><li>Senses: Darkvision, Devil's Sight (unaffected by magical darkness)</li><li>Resistance: Fire immunity, advantage on saving throws against magic.</li></ul><p><strong>Actions:</strong></p><ul><li>Multiattack: make 3 attacks, or 4 attacks if cast at 8th tier or higher.</li><li>Natural Weapons: 5ft reach, 1d10 + spell tier slashing damage.</li><li>Flame spear: 120ft range, 2d8 + spell tier fire damage. If the target is a flammable object that isn't being worn or carried, it also catches fire.</li></ul>"
    },
    {
      "id": "sunbeam",
      "name": "Sunbeam",
      "tier": "6th",
      "source": "Divine and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (60-foot line)",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>A beam of brilliant light flashes out from your hand in a 5-foot-wide, 60-foot-long line. Each creature in the line must make a CON save. On a failure, a creature takes 6d8 radiant damage and is blinded until your next turn. On a success, it takes half as much damage and isn't blinded by this spell. Undead have disadvantage on this save.</p><p>You can create a new line of radiance as your action on each turn until the spell ends.</p><p>For the duration, a mote of brilliant radiance shines in your hand. It sheds bright light in a 30-foot radius and dim light for an additional 30 feet. This light is sunlight.</p>"
    },
    {
      "id": "sunburst",
      "name": "Sunburst",
      "tier": "8th",
      "source": "Divine and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "150 feet (60-foot-radius sphere)",
      "components": "V, S",
      "duration": null,
      "description": "<p>Brilliant sunlight flashes in a 60-foot-radius sphere centered on a point you choose within range. Each creature in that light must make a CON save. On a failed save, a creature takes 12d6 radiant damage and is blinded for 1 minute. On a successful save, it takes half as much damage and isn't blinded by this spell. Undead have disadvantage on this save.</p><p>A creature blinded by this spell makes another CON save at the end of each of its turns. On a successful save, it is no longer blinded.</p><p>This spell dispels any darkness in its area that was created by a spell.</p>"
    },
    {
      "id": "telekinesis",
      "name": "Telekinesis",
      "tier": "5th",
      "source": "Arcane and Wyrd",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You move or manipulate creatures or objects by thought. When you cast the spell, and as your action each round for the duration, you can exert your will on one creature or object that you can see within range, causing the appropriate effect below. You can affect the same target round after round, or choose a new one at any time. If you switch targets, the prior target is no longer affected by the spell.</p><p><strong>Creature.</strong> You can try to move a Huge or smaller creature. Make an ability check with your spellcasting ability contested by the creature's STR check. If you win the contest, you move the creature up to 30 feet in any direction, including upward but not beyond the range of this spell. Until the end of your next turn, the creature is restrained in your telekinetic grip. A creature lifted upward is suspended in mid-air. On subsequent rounds, you can use your action to attempt to maintain your telekinetic grip on the creature by repeating the contest.</p><p><strong>Object.</strong> You can try to move an object that weighs up to 1,000 pounds. If the object isn't being worn or carried, you automatically move it up to 30 feet in any direction, but not beyond the range of this spell. If the object is worn or carried by a creature, you must make an ability check with your spellcasting ability contested by that creature's STR check. If you succeed, you pull the object away from that creature and can move it up to 30 feet in any direction but not beyond the range of this spell.</p><p>You can exert fine control on objects with your telekinetic grip, such as manipulating a simple tool, opening a door or a container, stowing or retrieving an item from an open container, or pouring the contents from a vial.</p>"
    },
    {
      "id": "telepathic_bond",
      "name": "Telepathic Bond",
      "tier": "5th",
      "source": "Arcane and Wyrd",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>You forge a telepathic link among up to eight willing creatures of your choice within range, psychically linking each creature to all the others for the duration. Creatures with an INT of 3 (4) or lower aren't affected by this spell. Until the spell ends, the targets can communicate telepathically through the bond whether or not they have a common language. The communication is possible over any distance, though it can't extend to other planes of existence.</p>"
    },
    {
      "id": "teleport",
      "name": "Teleport",
      "tier": "7th",
      "source": "Arcane",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "10 feet",
      "components": "V",
      "duration": null,
      "description": "<p>This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can't be held or carried by an unwilling creature.</p><p>The destination you choose must be known to you, and it must be on the same plane of existence as you. Your familiarity with the destination determines whether you arrive there successfully. The GM rolls d100 and consults the Destination Accuracy list.</p><p><strong>Familiarity.</strong> Permanent circle means a permanent teleportation circle whose sigil sequence you know. Associated object means that you possess an object taken from the desired destination within the last six months, such as a book from an arcanist's library, bed linen from a royal suite, or a chunk of marble from a lich's secret tomb.</p><p>Very familiar is a place you have been very often, a place you have carefully studied, or a place you can see when you cast the spell.</p><p>Seen casually is a place you have seen more than once but with which you aren't very familiar.</p><p>Viewed once is a place you have seen once, possibly using magic.</p><p>Description is a place whose location and appearance you know through someone else's description, perhaps from a map.</p><p><strong>False destination</strong> is a place that doesn't exist. Perhaps you tried to scry an enemy's sanctum but instead viewed an illusion, or you are attempting to teleport to a familiar location that no longer exists.</p><p><strong>On Target.</strong> You and your group (or the target object) appear where you want to.</p><p><strong>Off Target.</strong> You and your group (or the target object) appear a random distance away from the destination in a random direction. Distance off target is 1d10  1d10 percent of the distance that was to be traveled. For example, if you tried to travel 120 miles, landed off target, and rolled a 5 and 3 on the two d10s, then you would be off target by 15 percent, or 18 miles. The GM determines the direction off target randomly by rolling a d8 and designating 1 as north, 2 as northeast, 3 as east, and so on around the points of the compass. If you were teleporting to a coastal city and wound up 18 miles out at sea, you could be in trouble.</p><p><strong>Similar Area.</strong> You and your group (or the target object) wind up in a different area that's visually or thematically similar to the target area. If you are heading for your home laboratory, for example, you might wind up in another arcanist's laboratory or in an alchemical supply shop that has many of the same tools and implements as your laboratory. Generally, you appear in the closest similar place, but since the spell has no range limit, you could conceivably wind up anywhere on the plane.</p><p><strong>Mishap.</strong> The spell's unpredictable magic results in a difficult journey. Each teleporting creature (or the target object) takes 3d10 force damage, and the GM rerolls on the table to see where you wind up (multiple mishaps can occur, dealing damage each time).</p><p><strong>Destination Accuracy:</strong><br>Permanent Circle: 1-100 On Target<br>Associated Object: 1-100 On Target<br>Very Familiar: 1-5 Mishap, 6-13 Similar Area, 14-24 Off Target, 25-100 On Target<br>Seen Casually: 1-33 Mishap, 34-43 Similar Area, 44-53 Off Target, 54-100 On Target<br>Viewed Once/Description: 1-43 Mishap, 44-53 Similar Area, 54-73 Off Target, 74-100 On Target<br>False Destination: 1-50 Mishap, 51-100 Similar Area</p>"
    },
    {
      "id": "tether",
      "name": "Tether",
      "tier": "2nd",
      "source": "Arcane",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You target a creature or object within range, restraining it with a 30-foot magical tether connected to a point you choose (such as the ground, a building, or another creature). The target must make a DEX saving throw to avoid the effect. On a failed save, the target is tethered. It can use its action to make another DEX saving throw, ending the restraint on a success.</p><p>On subsequent rounds, as a bonus action, you can shorten or lengthen the tether by 10 feet.</p><p><em>At Higher Tiers</em>: The initial length of the tether increases by 10 feet for each additional tier.</p>"
    },
    {
      "id": "thaumaturgy",
      "name": "Thaumaturgy",
      "tier": "Cantrip",
      "source": "Divine and Wyrd",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V",
      "duration": "Up to 1 minute",
      "description": "<p>You manifest a minor sign of supernatural power. You create one of the following magical effects within range:</p><ul><li>Your voice booms up to three times as loud as normal for 1 minute.</li><li>You cause flames to flicker, brighten, dim, or change color for 1 minute.</li><li>You cause harmless tremors in the ground for 1 minute.</li><li>You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.</li><li>You instantaneously cause an unlocked door or window to fly open or slam shut.</li><li>You alter the appearance of your eyes for 1 minute.</li></ul><p>If you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action.</p>"
    },
    {
      "id": "thunderwave",
      "name": "Thunderwave",
      "tier": "1st",
      "source": "Arcane",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (15-foot cube)",
      "components": "V, S",
      "duration": null,
      "description": "<p>You create a forceful burst of sound that knocks back anything that fails to withstand it. Each creature in a 15-foot cube originating from you must make a CON save. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed.</p><p>In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible out to 300 feet.</p><p><strong>At Higher Tiers.</strong> Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "time_stop",
      "name": "Time Stop",
      "tier": "9th",
      "source": "Arcane",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V",
      "description": "<p>You briefly stop the flow of time for everyone but yourself. No time passes for other creatures while you take 1d4 + 1 turns in a row, during which you can use actions and move as normal.</p><p>This spell ends if one of the actions you use during this period, or any effects that you create during this period, affects a creature other than you or an object being worn or carried by someone other than you. In addition, the spell ends if you move to a place more than 1,000 feet from the location where you cast it.</p>"
    },
    {
      "id": "tongues",
      "name": "Tongues",
      "tier": "3rd",
      "source": "Arcane and Divine",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "1 hour",
      "description": "<p>Your target gains the ability to speak and listen with universal understanding. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says.</p>"
    },
    {
      "id": "tree_stride",
      "name": "Tree Stride",
      "tier": "5th",
      "source": "Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You gain the ability to enter a tree and move from inside it to inside another tree of the same kind within 500 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree. You instantly know the location of all other trees of the same kind within 500 feet and, as part of the move used to enter the tree, can either pass into one of those trees or step out of the tree you're in. You appear in a space of your choice within 5 feet of the destination tree using another 5 feet of movement. If you have no movement left, you appear within 5 feet of the tree you entered.</p><p>You can use this transportation ability once per round for the duration. You must end each turn outside a tree.</p>"
    },
    {
      "id": "transmogrification",
      "name": "Transmogrification",
      "tier": "7th",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M (flesh from a Fiend, a feather from a Celestial, or a scale from a Dragon worth 50 gp)",
      "duration": "1 minute",
      "description": "<p>You transform your body to grant yourself benefits of monstrous forms. When you cast this spell, choose one of the listed transformations that your form first assumes. While the spell is active, you can use a bonus action to exchange your current transformation for a different option you haven't already used during this casting of the spell. Once you assume your third form, you can't shift into a different listed form for the duration, but you can use a bonus action to end the spell early and assume your original form.</p><p><strong>Wings:</strong> You sprout wings from your shoulders and gain a flying speed of 60 feet. The wings can be batlike or feathered.</p><p><strong>Breath Weapon:</strong> You gain a breath weapon of acid, cold, fire, lightning, or poison. Use an action to unleash your breath weapon in a 15-foot line that is 5 feet wide. Each creature in the line must make a DEX save, taking 8d8 damage on a failure, or half as much on a success. You can use the breath weapon up to three times.</p><p><strong>Limbs:</strong> You sprout additional appendages. Use them to make two melee attacks with a 10-foot reach. The attacks deal 2d12 + your spellcasting modifier in damage. Choose bludgeoning, piercing, or slashing damage.</p><p><strong>Radiating Light:</strong> You emit damaging light in a 10-foot radius, dealing 2d10 necrotic, fire, or radiant damage to creatures entering the light or starting their turn there. A CON save halves the damage.</p><p><strong>Regeneration:</strong> You regain 10 HP at the start of your turn, up to three times.</p><p><strong>Overwhelming Might:</strong> Your melee attacks deal an additional 2d8 force damage, and creatures you hit must make a STR save or be knocked prone.</p><p><strong>Frightening Presence:</strong> You can frighten creatures within 30 feet with a WIS save. They remain frightened for 1 minute but can repeat the save at the end of each of their turns. This ability can be used up to three times.</p>"
    },
    {
      "id": "transport_via_plants",
      "name": "Transport via Plants",
      "tier": "6th",
      "source": "Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "10 feet",
      "components": "V, S",
      "duration": "1 round",
      "description": "<p>This spell creates a magical link between a Large or larger nonmagical plant within range and another plant, at any distance, on the same plane of existence. You must have seen or touched the destination plant at least once before.</p><p>For the duration, any creature can step into the target plant and exit from the destination plant by using 5 feet of movement.</p>"
    },
    {
      "id": "true_polymorph",
      "name": "True Polymorph",
      "tier": "9th",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You transform one creature or nonmagical object you can see within range into a new form. If you concentrate on this spell for the full duration, the transformation becomes permanent.</p><p><strong>Creature into Creature:</strong> The new form can be any creature whose challenge rating is equal to or less than the target's. The target's statistics, including mental abilities, are replaced by those of the new form. It retains its personality and assumes the hit points of its new form.</p><p><strong>Object into Creature:</strong> You can turn an object into a creature with a challenge rating of 9 or lower. It is friendly to you and acts on your turn, though you lose control of it if the spell becomes permanent.</p><p><strong>Creature into Object:</strong> The target's statistics become those of the object, and it loses memory of time spent in this form after the spell ends.</p>"
    },
    {
      "id": "true_seeing",
      "name": "True Seeing",
      "tier": "6th",
      "source": "Arcane, Divine, and Wyrd",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (ointment worth 25 gp, which the spell consumes)",
      "duration": "1 hour",
      "description": "<p>You touch a willing creature to grant it truesight to a range of 120 feet, allowing it to see things as they actually are for the duration.</p><p><strong>At Higher Tiers:</strong> You can target one additional creature for each tier above 6th.</p>"
    },
    {
      "id": "true_strike",
      "name": "True Strike",
      "tier": "Cantrip",
      "source": "Arcane",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "S",
      "duration": "Concentration, up to 1 round",
      "description": "<p>You point at a target in range and foretell a momentary weakness. On your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn't ended.</p>"
    },
    {
      "id": "vampiric_touch",
      "name": "Vampiric Touch",
      "tier": "3rd",
      "source": "Arcane",
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>The touch of your shadow-wreathed hand can siphon life force from others to heal your wounds. Make a melee spell attack against a creature within your reach. On a hit, the target takes 3d6 necrotic damage, and you regain hit points equal to half the amount of necrotic damage dealt. Until the spell ends, you can make the attack again on each of your turns as an action.</p><p><strong>At Higher Tiers:</strong> Add +1d6 damage for each additional tier.</p>"
    },
    {
      "id": "vicious_mockery",
      "name": "Vicious Mockery",
      "tier": "Cantrip",
      "source": "Arcane and Wyrd",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "description": "<p>You unleash a string of insults laced with subtle enchantments at a creature you can see within range. If the target can hear you (though it need not understand you), it must succeed on a WIS save or take 1d4 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn.</p><p><strong>At Higher Tiers:</strong> This spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).</p>"
    },
    {
      "id": "wall_of_fire",
      "name": "Wall of Fire",
      "tier": "4th",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You conjure a wall of roiling flame, burning your enemies with superheated fire. You create a wall of fire on a solid surface in a line up to 60 feet long, 20 feet high, and 1 foot thick, or in a circle up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.</p><p>When the wall appears, each creature within its area must make a DEX save. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save.</p><p>One side of the wall, selected by you when you cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet of that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side of the wall deals no damage.</p><p><strong>At Higher Tiers:</strong> Add 1d8 damage for each additional tier.</p>"
    },
    {
      "id": "wall_of_force",
      "name": "Wall of Force",
      "tier": "5th",
      "source": "Arcane and Wyrd",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>An invisible wall of force springs into existence at a point you choose within range. The wall appears in any orientation you choose as a horizontal or vertical barrier or at an angle. It can be free floating or resting on a solid surface. You can form it into a hemispherical dome or a sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-by-10-foot panels. Each panel must be contiguous with another panel. In any form, the wall is 1/4 inch thick. It lasts for the duration.</p><p>If the wall cuts through a creature's space when it appears, the creature is pushed to one side of the wall (your choice).</p><p>Nothing can physically pass through the wall. It is immune to all damage and can't be dispelled by the dispel magic spell. However, a disintegrate spell destroys the wall instantly. The wall also extends into the Ethereal Plane, blocking ethereal travel through the wall.</p>"
    },
    {
      "id": "wall_of_ice",
      "name": "Wall of Ice",
      "tier": "6th",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You create a wall of ice on a solid surface within range. You can form it into a hemispherical dome or a sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-square panels. Each panel must be contiguous with another panel. In any form, the wall is 1 foot thick and lasts for the duration.</p><p>If the wall cuts through a creature's space when it appears, the creature within its area is pushed to one side of the wall (your choice) and must make a DEX save. On a failure, the creature takes 10d6 cold damage or half as much damage on a success.</p><p>The wall is an object that can be damaged and thus breached. It has AC 12 and 30 HP per 10-foot section, and it is vulnerable to fire damage. Reducing a 10-foot section of wall to 0 HP destroys it and leaves behind a sheet of frigid air in the space the wall occupied. A creature moving through the sheet of frigid air for the first time on a turn must make a CON save. That creature takes 5d6 cold damage on a failed save, or half as much damage on a successful one.</p><p><strong>At Higher Tiers:</strong> For each additional tier, add 2d6 to the initial damage and 1d6 to the damage from passing through the sheet of frigid air.</p>"
    },
    {
      "id": "wall_of_stone",
      "name": "Wall of Stone",
      "tier": "5th",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You conjure solid stone from nothing, forming a wall, bridge, dome, or similar structure. The wall is 6 inches thick and is composed of ten 10-foot by 10-foot panels. Each panel must be contiguous with at least one other panel. Alternatively, you can create 10-foot by 20-foot panels that are only 3 inches thick.</p><p>If the wall cuts through a creature's space when it appears, the creature is pushed to one side of the wall (your choice). If a creature would be surrounded on all sides by the wall (or the wall and another solid surface), that creature can make a DEX save. On a success, it can use its reaction to move up to its speed so that it is no longer enclosed by the wall.</p><p>The wall can have any shape you desire, though it can't occupy the same space as a creature or object. The wall doesn't need to be vertical or rest on any firm foundation. It must, however, merge with and be solidly supported by existing stone. Thus, you can use this spell to bridge a chasm or create a ramp.</p><p>If you create a span greater than 20 feet in length, you must halve the size of each panel to create supports. You can crudely shape the wall to create crenellations, battlements, and so on.</p><p>The wall is an object made of stone that can be damaged and thus breached. Each panel has AC 15 and 30 hit points per inch of thickness. Reducing a panel to 0 hit points destroys it and might cause connected panels to collapse at the GM's discretion.</p><p>If you maintain your concentration on this spell for its whole duration, the wall becomes permanent and can't be dispelled. Otherwise, the wall disappears when the spell ends.</p>"
    },
    {
      "id": "wall_of_thorns",
      "name": "Wall of Thorns",
      "tier": "6th",
      "source": "Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "<p>You create a wall of tough, pliable, tangled brush bristling with needle-sharp thorns. The wall appears within range on a solid surface and lasts for the duration. You choose to make the wall up to 60 feet long, 10 feet high, and 5 feet thick or a circle that has a 20-foot diameter and is up to 20 feet high and 5 feet thick. The wall blocks line of sight.</p><p>When the wall appears, each creature within its area must make a DEX save. On a failure, a creature takes 7d8 piercing damage or half as much damage on a success.</p><p>A creature can move through the wall, albeit slowly and painfully. For every 1 foot a creature moves through the wall, it must spend 4 feet of movement. Furthermore, the first time a creature enters the wall on a turn or ends its turn there, the creature must make a DEX save. It takes 7d8 slashing damage on a failed save, or half as much damage on a successful one.</p><p><strong>At Higher Tiers:</strong> Add 1d8 to both types of damage for each additional tier.</p>"
    },
    {
      "id": "warding_bond",
      "name": "Warding Bond",
      "tier": "2nd",
      "source": "Divine",
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (a pair of platinum rings worth 50 gp each, which you and the target must wear for the duration)",
      "duration": "1 hour",
      "description": "<p>You bless a pair of rings that you and your target wear, intertwining their lifeforce with your own. This spell wards a willing creature you touch and creates a mystic connection between you and the target until the spell ends. While the target is within 60 feet of you, it gains a +1 bonus to AC and saves, and it has resistance to all damage. However, each time it takes damage, you take the same amount of damage.</p><p>The spell ends if you drop to 0 hit points or if you and the target become separated by more than 60 feet. It also ends if the spell is cast again on either of the connected creatures. You can also dismiss the spell as an action.</p>"
    },
    {
      "id": "water_breathing",
      "name": "Water Breathing",
      "tier": "3rd",
      "source": "Arcane and Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "24 hours",
      "description": "<p>You grant a large group of creatures with the ability to breathe underwater. This spell grants up to ten willing creatures you can see within range the ability to breathe underwater until the spell ends. Affected creatures also retain their normal mode of respiration.</p>"
    },
    {
      "id": "web",
      "name": "Web",
      "tier": "2nd",
      "source": "Arcane and Primordial",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "<p>You conjure a large swath of exceptionally sticky spider-silk webbing. The webs fill a 20-foot cube from your chosen point for the duration. The webs are difficult terrain and lightly obscure their area. If the webs aren't anchored between two solid masses (such as walls or trees) or layered across a floor, wall, or ceiling, the conjured web collapses on itself, and the spell ends at the start of your next turn.</p><p>Each creature that starts its turn in the webs or that enters them during its turn must make a DEX save. On a failed save, the creature is restrained as long as it remains in the webs or until it breaks free. A creature restrained by the webs can use its action to make a STR check against your spell save DC. If it succeeds, it is no longer restrained.</p><p>The webs are flammable. Any 5-foot cube of webs exposed to fire burns away in 1 round, dealing 2d4 fire damage to any creature that starts its turn in the fire.</p>"
    },
    {
      "id": "weird",
      "name": "Weird",
      "tier": "9th",
      "source": "Arcane and Wyrd",
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>Drawing on the deepest fears of a group of creatures, you create illusory creatures in their minds visible only to them. Each creature in a 30-foot-radius sphere centered on a point of your choice within range must make a WIS save. On a failed save, a creature becomes frightened of you for the duration. The illusion calls on the creature's deepest fears, manifesting its worst nightmares as an implacable threat.</p><p>At the end of each of the frightened creature's turns, it must succeed on a WIS save or take 4d10 psychic damage. On a successful save, the spell ends for that creature.</p>"
    },
    {
      "id": "wildsense",
      "name": "Wildsense",
      "tier": "2nd",
      "source": "Primordial",
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "S",
      "duration": "1 hour",
      "description": "<p>You perceive the world through a willing creature's senses. You touch a willing Beast or creature with the Animal tag, creating a mystic link that lasts for the duration. While linked, you can use an action to see through the target's eyes, hear what it hears, and perceive what it perceives via any of its special senses. You are blinded and deafened while using the target's senses. As an action, you can resume use of your own senses. At any time, you can use an action to break the link completely, ending the spell.</p>"
    },
    {
      "id": "wind_walk",
      "name": "Wind Walk",
      "tier": "6th",
      "source": "Primordial",
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "8 hours",
      "description": "<p>You and up to ten willing creatures you can see within range assume a gaseous form for the duration, appearing as wisps of cloud. While in this cloud form, a creature has a flying speed of 300 feet and has resistance to damage from nonmagical attacks. The only actions a creature can take in this form are the Dash action or to revert to its normal form.</p><p>Reverting takes 1 minute, during which time a creature is incapacitated and can't move. Until the spell ends, a creature can revert to cloud form, which also requires the 1-minute transformation.</p><p>If a creature is in cloud form and flying when the effect ends, the creature descends 60 feet per round for 1 minute until it lands safely. If it can't land after 1 minute, the creature falls the remaining distance.</p>"
    },
    {
      "id": "wind_wall",
      "name": "Wind Wall",
      "tier": "3rd",
      "source": "Arcane and Primordial",
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "<p>You conjure a wall of swirling winds that buffets nearby creatures and wards against flimsy projectiles and airborne gasses. You can make the wall up to 50 feet long, 15 feet high, and 1 foot thick. You can shape the wall in any way you choose so long as it makes one continuous path along the ground. The wall lasts for the duration.</p><p>When the wall appears, each creature within its area must make a STR save. A creature takes 3d8 bludgeoning damage on a failed save, or half as much damage on a successful one.</p><p>The strong wind keeps fog, smoke, and other gasses at bay. Small or smaller flying creatures or objects can't pass through the wall. Loose, lightweight materials brought into the wall fly upward. Arrows, bolts, and other ordinary projectiles launched at targets behind the wall are deflected upward and automatically miss. (Boulders hurled by giants or siege engines, and similar projectiles, are unaffected.) Creatures in gaseous form can't pass through it.</p>"
    },
    {
      "id": "wish",
      "name": "Wish",
      "tier": "9th",
      "source": "Arcane and Wyrd",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V",
      "description": "<p>Wish is the mightiest spell a mortal creature can cast. By simply speaking aloud, you can alter the very foundations of reality in accord with your desires. The basic use of this spell is to duplicate any other spell of 8th tier or lower. You don't need to meet any requirements in that spell, including costly components. The spell simply takes effect.</p><p>Alternatively, you can create one of the following effects of your choice:</p><ul><li>You create one object of up to 25,000 gp in value that isn't a magic item. The object can be no more than 300 feet in any dimension, and it appears in an unoccupied space you can see on the ground.</li><li>You allow up to twenty creatures that you can see to regain all hit points, and you end all effects on them described in the greater restoration spell.</li><li>You grant up to ten creatures that you can see resistance to a damage type you choose.</li><li>You grant up to ten creatures you can see immunity to a single spell or other magical effect for 8 hours. For instance, you could make yourself and all your companions immune to a lich's Life Drain attack.</li><li>You undo a single recent event by forcing a reroll of any roll made within the last round (including your last turn). Reality reshapes itself to accommodate the new result. For example, a wish spell could undo an opponent's successful save, a foe's critical hit, or a friend's failed save. You can force the reroll to be made with advantage or disadvantage, and you can choose whether to use the reroll or the original roll.</li></ul><p>You might be able to achieve something beyond the scope of the above examples. State your wish to the GM as precisely as possible. The GM has great latitude in ruling what occurs in such an instance; the greater the wish, the greater the likelihood that something goes wrong. This spell might simply fail, the effect you desire might only be partly achieved, or you might suffer some unforeseen consequence as a result of how you worded the wish. For example, wishing that a villain were dead might propel you forward in time to a period when that villain is no longer alive, effectively removing you from the game. Similarly, wishing for a legendary magic item or artifact might instantly transport you to the presence of the item's current owner.</p><p>The stress of casting this spell to produce any effect other than duplicating another spell weakens you. After enduring that stress, each time you cast a spell until you finish a long rest, you take 1d10 necrotic damage per tier of that spell. This damage can't be reduced or prevented in any way. In addition, your STR modifier drops to -4, if it isn't -4 or lower already, for 2d4 days. For each of those days that you spend resting and doing nothing more than light activity, your remaining recovery time decreases by 2 days. Finally, there is a 33 percent chance that you are unable to cast wish ever again if you suffer this stress.</p>"
    },
    {
      "id": "word_of_recall",
      "name": "Word of Recall",
      "tier": "6th",
      "source": "Divine",
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "5 feet",
      "components": "V",
      "description": "<p>You and up to five willing creatures within 5 feet of you instantly teleport to a previously designated sanctuary. You and creatures that teleport with you appear in an unoccupied space nearest to the spot you designated when you prepared your sanctuary. If you cast this spell without first preparing a sanctuary, the spell has no effect.</p><p>You must designate a sanctuary by casting this spell within a location, such as a temple, dedicated to or strongly linked to your deity. If you attempt to cast the spell in an area that isn't dedicated to your deity, the spell has no effect.</p>"
    },
    {
      "id": "zone_of_truth",
      "name": "Zone of Truth",
      "tier": "2nd",
      "source": "Divine",
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "10 minutes",
      "description": "<p>You create a sphere in which no one can lie. You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there must make a CHA save. On a failed save, a creature can't speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its save.</p><p>An affected creature is aware of the spell and can thus avoid answering questions to which it would normally respond with a lie. Such a creature can be evasive in its answers as long as it remains within the boundaries of the truth.</p>"
    }
  ]
}